espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_OUT_DSCR_BF1_CH0_REG register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
#define DMA2D_OUT_DSCR_BF1_CH0_REG (DR_REG_DMA2D_BASE + 0x34)
/** DMA2D_OUTLINK_DSCR_BF1_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define DMA2D_OUTLINK_DSCR_BF1_CH0    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH0_M  (DMA2D_OUTLINK_DSCR_BF1_CH0_V << DMA2D_OUTLINK_DSCR_BF1_CH0_S)
#define DMA2D_OUTLINK_DSCR_BF1_CH0_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH0_S  0

/** DMA2D_OUT_PERI_SEL_CH0_REG register
 *  Configures the tx peripheral of channel 0
 */
#define DMA2D_OUT_PERI_SEL_CH0_REG (DR_REG_DMA2D_BASE + 0x38)
/** DMA2D_OUT_PERI_SEL_CH0 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Tx channel   0:  jpeg     1:
 *  display-1     2: display-2     3: display-3      7: no choose
 */
#define DMA2D_OUT_PERI_SEL_CH0    0x00000007U
#define DMA2D_OUT_PERI_SEL_CH0_M  (DMA2D_OUT_PERI_SEL_CH0_V << DMA2D_OUT_PERI_SEL_CH0_S)
#define DMA2D_OUT_PERI_SEL_CH0_V  0x00000007U
#define DMA2D_OUT_PERI_SEL_CH0_S  0

/** DMA2D_OUT_ARB_CH0_REG register
 *  Configures the tx arbiter of channel 0
 */
#define DMA2D_OUT_ARB_CH0_REG (DR_REG_DMA2D_BASE + 0x3c)
/** DMA2D_OUT_ARB_TOKEN_NUM_CH0 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_OUT_ARB_TOKEN_NUM_CH0    0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH0_M  (DMA2D_OUT_ARB_TOKEN_NUM_CH0_V << DMA2D_OUT_ARB_TOKEN_NUM_CH0_S)
#define DMA2D_OUT_ARB_TOKEN_NUM_CH0_V  0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH0_S  0
/** DMA2D_OUT_ARB_PRIORITY_CH0 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define DMA2D_OUT_ARB_PRIORITY_CH0    0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_CH0_M  (DMA2D_OUT_ARB_PRIORITY_CH0_V << DMA2D_OUT_ARB_PRIORITY_CH0_S)
#define DMA2D_OUT_ARB_PRIORITY_CH0_V  0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_CH0_S  4
/** DMA2D_OUT_ARB_PRIORITY_H_CH0 : R/W; bitpos: [7:6]; default: 0;
 *  Set the priority of channel
 */
#define DMA2D_OUT_ARB_PRIORITY_H_CH0    0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_H_CH0_M  (DMA2D_OUT_ARB_PRIORITY_H_CH0_V << DMA2D_OUT_ARB_PRIORITY_H_CH0_S)
#define DMA2D_OUT_ARB_PRIORITY_H_CH0_V  0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_H_CH0_S  6

/** DMA2D_OUT_RO_STATUS_CH0_REG register
 *  Represents the status of the tx reorder module of channel 0
 */
#define DMA2D_OUT_RO_STATUS_CH0_REG (DR_REG_DMA2D_BASE + 0x40)
/** DMA2D_OUTFIFO_RO_CNT_CH0 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in color convert Tx FIFO for
 *  channel 0.
 */
#define DMA2D_OUTFIFO_RO_CNT_CH0    0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH0_M  (DMA2D_OUTFIFO_RO_CNT_CH0_V << DMA2D_OUTFIFO_RO_CNT_CH0_S)
#define DMA2D_OUTFIFO_RO_CNT_CH0_V  0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH0_S  0
/** DMA2D_OUT_RO_WR_STATE_CH0 : RO; bitpos: [7:6]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_OUT_RO_WR_STATE_CH0    0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH0_M  (DMA2D_OUT_RO_WR_STATE_CH0_V << DMA2D_OUT_RO_WR_STATE_CH0_S)
#define DMA2D_OUT_RO_WR_STATE_CH0_V  0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH0_S  6
/** DMA2D_OUT_RO_RD_STATE_CH0 : RO; bitpos: [9:8]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_OUT_RO_RD_STATE_CH0    0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH0_M  (DMA2D_OUT_RO_RD_STATE_CH0_V << DMA2D_OUT_RO_RD_STATE_CH0_S)
#define DMA2D_OUT_RO_RD_STATE_CH0_V  0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH0_S  8
/** DMA2D_OUT_PIXEL_BYTE_CH0 : RO; bitpos: [13:10]; default: 0;
 *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_OUT_PIXEL_BYTE_CH0    0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH0_M  (DMA2D_OUT_PIXEL_BYTE_CH0_V << DMA2D_OUT_PIXEL_BYTE_CH0_S)
#define DMA2D_OUT_PIXEL_BYTE_CH0_V  0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH0_S  10
/** DMA2D_OUT_BURST_BLOCK_NUM_CH0 : RO; bitpos: [17:14]; default: 0;
 *  the number of macro blocks contained in a burst of data at TX channel
 */
#define DMA2D_OUT_BURST_BLOCK_NUM_CH0    0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH0_M  (DMA2D_OUT_BURST_BLOCK_NUM_CH0_V << DMA2D_OUT_BURST_BLOCK_NUM_CH0_S)
#define DMA2D_OUT_BURST_BLOCK_NUM_CH0_V  0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH0_S  14

/** DMA2D_OUT_RO_PD_CONF_CH0_REG register
 *  Configures the tx reorder memory of channel 0
 */
#define DMA2D_OUT_RO_PD_CONF_CH0_REG (DR_REG_DMA2D_BASE + 0x44)
/** DMA2D_OUT_RO_RAM_FORCE_PD_CH0 : R/W; bitpos: [4]; default: 0;
 *  dma reorder ram power down
 */
#define DMA2D_OUT_RO_RAM_FORCE_PD_CH0    (BIT(4))
#define DMA2D_OUT_RO_RAM_FORCE_PD_CH0_M  (DMA2D_OUT_RO_RAM_FORCE_PD_CH0_V << DMA2D_OUT_RO_RAM_FORCE_PD_CH0_S)
#define DMA2D_OUT_RO_RAM_FORCE_PD_CH0_V  0x00000001U
#define DMA2D_OUT_RO_RAM_FORCE_PD_CH0_S  4
/** DMA2D_OUT_RO_RAM_FORCE_PU_CH0 : R/W; bitpos: [5]; default: 1;
 *  dma reorder ram power up
 */
#define DMA2D_OUT_RO_RAM_FORCE_PU_CH0    (BIT(5))
#define DMA2D_OUT_RO_RAM_FORCE_PU_CH0_M  (DMA2D_OUT_RO_RAM_FORCE_PU_CH0_V << DMA2D_OUT_RO_RAM_FORCE_PU_CH0_S)
#define DMA2D_OUT_RO_RAM_FORCE_PU_CH0_V  0x00000001U
#define DMA2D_OUT_RO_RAM_FORCE_PU_CH0_S  5
/** DMA2D_OUT_RO_RAM_CLK_FO_CH0 : R/W; bitpos: [6]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
 *  0: A gate-clock will be used when accessing the RAM in DMA.
 */
#define DMA2D_OUT_RO_RAM_CLK_FO_CH0    (BIT(6))
#define DMA2D_OUT_RO_RAM_CLK_FO_CH0_M  (DMA2D_OUT_RO_RAM_CLK_FO_CH0_V << DMA2D_OUT_RO_RAM_CLK_FO_CH0_S)
#define DMA2D_OUT_RO_RAM_CLK_FO_CH0_V  0x00000001U
#define DMA2D_OUT_RO_RAM_CLK_FO_CH0_S  6

/** DMA2D_OUT_COLOR_CONVERT_CH0_REG register
 *  Configures the tx color convert of channel 0
 */
#define DMA2D_OUT_COLOR_CONVERT_CH0_REG (DR_REG_DMA2D_BASE + 0x48)
/** DMA2D_OUT_COLOR_OUTPUT_SEL_CH0 : R/W; bitpos: [1:0]; default: 0;
 *  Set final color convert process and output type    0: RGB888 to RGB565     1:
 *  YUV444 to YUV422     2: output directly
 */
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH0    0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH0_M  (DMA2D_OUT_COLOR_OUTPUT_SEL_CH0_V << DMA2D_OUT_COLOR_OUTPUT_SEL_CH0_S)
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH0_V  0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH0_S  0
/** DMA2D_OUT_COLOR_3B_PROC_EN_CH0 : R/W; bitpos: [2]; default: 0;
 *  Enable generic color convert module between color input & color output, need to
 *  configure parameter.
 */
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH0    (BIT(2))
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH0_M  (DMA2D_OUT_COLOR_3B_PROC_EN_CH0_V << DMA2D_OUT_COLOR_3B_PROC_EN_CH0_S)
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH0_V  0x00000001U
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH0_S  2
/** DMA2D_OUT_COLOR_INPUT_SEL_CH0 : R/W; bitpos: [5:3]; default: 7;
 *  Set first color convert process and input color type    0: RGB565 to RGB888     1:
 *  YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7:
 *  disable color space convert
 */
#define DMA2D_OUT_COLOR_INPUT_SEL_CH0    0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH0_M  (DMA2D_OUT_COLOR_INPUT_SEL_CH0_V << DMA2D_OUT_COLOR_INPUT_SEL_CH0_S)
#define DMA2D_OUT_COLOR_INPUT_SEL_CH0_V  0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH0_S  3

/** DMA2D_OUT_SCRAMBLE_CH0_REG register
 *  Configures the tx scramble of channel 0
 */
#define DMA2D_OUT_SCRAMBLE_CH0_REG (DR_REG_DMA2D_BASE + 0x4c)
/** DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0    0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0_M  (DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0_V << DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0_S)
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0_V  0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH0_S  0

/** DMA2D_OUT_COLOR_PARAM0_CH0_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM0_CH0_REG (DR_REG_DMA2D_BASE + 0x50)
/** DMA2D_OUT_COLOR_PARAM_H0_CH0 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H0_CH0    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH0_M  (DMA2D_OUT_COLOR_PARAM_H0_CH0_V << DMA2D_OUT_COLOR_PARAM_H0_CH0_S)
#define DMA2D_OUT_COLOR_PARAM_H0_CH0_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH0_S  0

