espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_OUT_SCRAMBLE_CH2_REG register
 *  Configures the tx scramble of channel 2
 */
#define DMA2D_OUT_SCRAMBLE_CH2_REG (DR_REG_DMA2D_BASE + 0x24c)
/** DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2    0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_M  (DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_V << DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_S)
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_V  0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM0_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM0_CH2_REG (DR_REG_DMA2D_BASE + 0x250)
/** DMA2D_OUT_COLOR_PARAM_H0_CH2 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_M  (DMA2D_OUT_COLOR_PARAM_H0_CH2_V << DMA2D_OUT_COLOR_PARAM_H0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM1_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM1_CH2_REG (DR_REG_DMA2D_BASE + 0x254)
/** DMA2D_OUT_COLOR_PARAM_H1_CH2 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_M  (DMA2D_OUT_COLOR_PARAM_H1_CH2_V << DMA2D_OUT_COLOR_PARAM_H1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM2_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM2_CH2_REG (DR_REG_DMA2D_BASE + 0x258)
/** DMA2D_OUT_COLOR_PARAM_M0_CH2 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_M  (DMA2D_OUT_COLOR_PARAM_M0_CH2_V << DMA2D_OUT_COLOR_PARAM_M0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM3_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM3_CH2_REG (DR_REG_DMA2D_BASE + 0x25c)
/** DMA2D_OUT_COLOR_PARAM_M1_CH2 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_M  (DMA2D_OUT_COLOR_PARAM_M1_CH2_V << DMA2D_OUT_COLOR_PARAM_M1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM4_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM4_CH2_REG (DR_REG_DMA2D_BASE + 0x260)
/** DMA2D_OUT_COLOR_PARAM_L0_CH2 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_M  (DMA2D_OUT_COLOR_PARAM_L0_CH2_V << DMA2D_OUT_COLOR_PARAM_L0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM5_CH2_REG register
 *  Configures the tx color convert parameter of channel 2
 */
#define DMA2D_OUT_COLOR_PARAM5_CH2_REG (DR_REG_DMA2D_BASE + 0x264)
/** DMA2D_OUT_COLOR_PARAM_L1_CH2 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_M  (DMA2D_OUT_COLOR_PARAM_L1_CH2_V << DMA2D_OUT_COLOR_PARAM_L1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_S  0

/** DMA2D_OUT_ETM_CONF_CH2_REG register
 *  Configures the tx etm of channel 2
 */
#define DMA2D_OUT_ETM_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x268)
/** DMA2D_OUT_ETM_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_EN_CH2    (BIT(0))
#define DMA2D_OUT_ETM_EN_CH2_M  (DMA2D_OUT_ETM_EN_CH2_V << DMA2D_OUT_ETM_EN_CH2_S)
#define DMA2D_OUT_ETM_EN_CH2_V  0x00000001U
#define DMA2D_OUT_ETM_EN_CH2_S  0
/** DMA2D_OUT_ETM_LOOP_EN_CH2 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_LOOP_EN_CH2    (BIT(1))
#define DMA2D_OUT_ETM_LOOP_EN_CH2_M  (DMA2D_OUT_ETM_LOOP_EN_CH2_V << DMA2D_OUT_ETM_LOOP_EN_CH2_S)
#define DMA2D_OUT_ETM_LOOP_EN_CH2_V  0x00000001U
#define DMA2D_OUT_ETM_LOOP_EN_CH2_S  1
/** DMA2D_OUT_DSCR_TASK_MAK_CH2 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_OUT_DSCR_TASK_MAK_CH2    0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_M  (DMA2D_OUT_DSCR_TASK_MAK_CH2_V << DMA2D_OUT_DSCR_TASK_MAK_CH2_S)
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_V  0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_S  2

/** DMA2D_OUT_DSCR_PORT_BLK_CH2_REG register
 *  Configures the tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_CH2_REG (DR_REG_DMA2D_BASE + 0x26c)
/** DMA2D_OUT_DSCR_PORT_BLK_H_CH2 : R/W; bitpos: [13:0]; default: 18;
 *  Set the vertical height of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_M  (DMA2D_OUT_DSCR_PORT_BLK_H_CH2_V << DMA2D_OUT_DSCR_PORT_BLK_H_CH2_S)
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_S  0
/** DMA2D_OUT_DSCR_PORT_BLK_V_CH2 : R/W; bitpos: [27:14]; default: 18;
 *  Set the horizontal width of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_M  (DMA2D_OUT_DSCR_PORT_BLK_V_CH2_V << DMA2D_OUT_DSCR_PORT_BLK_V_CH2_S)
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_S  14

/** DMA2D_OUT_CONF0_CH3_REG register
 *  Configures the tx direction of channel 3
 */
#define DMA2D_OUT_CONF0_CH3_REG (DR_REG_DMA2D_BASE + 0x300)
/** DMA2D_OUT_AUTO_WRBACK_CH3 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable automatic outlink-writeback when all the data pointed by
 *  outlink descriptor has been received.
 */
#define DMA2D_OUT_AUTO_WRBACK_CH3    (BIT(0))
#define DMA2D_OUT_AUTO_WRBACK_CH3_M  (DMA2D_OUT_AUTO_WRBACK_CH3_V << DMA2D_OUT_AUTO_WRBACK_CH3_S)
#define DMA2D_OUT_AUTO_WRBACK_CH3_V  0x00000001U
#define DMA2D_OUT_AUTO_WRBACK_CH3_S  0
/** DMA2D_OUT_EOF_MODE_CH3 : R/W; bitpos: [1]; default: 1;
 *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
 *  generated when data need to read has been popped from FIFO in DMA
 */
#define DMA2D_OUT_EOF_MODE_CH3    (BIT(1))
#define DMA2D_OUT_EOF_MODE_CH3_M  (DMA2D_OUT_EOF_MODE_CH3_V << DMA2D_OUT_EOF_MODE_CH3_S)
#define DMA2D_OUT_EOF_MODE_CH3_V  0x00000001U
#define DMA2D_OUT_EOF_MODE_CH3_S  1
/** DMA2D_OUTDSCR_BURST_EN_CH3 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
 *  descriptor when accessing internal SRAM.
 */
#define DMA2D_OUTDSCR_BURST_EN_CH3    (BIT(2))
#define DMA2D_OUTDSCR_BURST_EN_CH3_M  (DMA2D_OUTDSCR_BURST_EN_CH3_V << DMA2D_OUTDSCR_BURST_EN_CH3_S)
#define DMA2D_OUTDSCR_BURST_EN_CH3_V  0x00000001U
#define DMA2D_OUTDSCR_BURST_EN_CH3_S  2
/** DMA2D_OUT_ECC_AES_EN_CH3 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define DMA2D_OUT_ECC_AES_EN_CH3    (BIT(3))
#define DMA2D_OUT_ECC_AES_EN_CH3_M  (DMA2D_OUT_ECC_AES_EN_CH3_V << DMA2D_OUT_ECC_AES_EN_CH3_S)
#define DMA2D_OUT_ECC_AES_EN_CH3_V  0x00000001U
#define DMA2D_OUT_ECC_AES_EN_CH3_S  3
/** DMA2D_OUT_CHECK_OWNER_CH3 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define DMA2D_OUT_CHECK_OWNER_CH3    (BIT(4))
#define DMA2D_OUT_CHECK_OWNER_CH3_M  (DMA2D_OUT_CHECK_OWNER_CH3_V << DMA2D_OUT_CHECK_OWNER_CH3_S)
#define DMA2D_OUT_CHECK_OWNER_CH3_V  0x00000001U
#define DMA2D_OUT_CHECK_OWNER_CH3_S  4
/** DMA2D_OUT_LOOP_TEST_CH3 : R/W; bitpos: [5]; default: 0;
 *  reserved
 */
#define DMA2D_OUT_LOOP_TEST_CH3    (BIT(5))
#define DMA2D_OUT_LOOP_TEST_CH3_M  (DMA2D_OUT_LOOP_TEST_CH3_V << DMA2D_OUT_LOOP_TEST_CH3_S)
#define DMA2D_OUT_LOOP_TEST_CH3_V  0x00000001U
#define DMA2D_OUT_LOOP_TEST_CH3_S  5
/** DMA2D_OUT_MEM_BURST_LENGTH_CH3 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Tx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define DMA2D_OUT_MEM_BURST_LENGTH_CH3    0x00000007U
#define DMA2D_OUT_MEM_BURST_LENGTH_CH3_M  (DMA2D_OUT_MEM_BURST_LENGTH_CH3_V << DMA2D_OUT_MEM_BURST_LENGTH_CH3_S)
#define DMA2D_OUT_MEM_BURST_LENGTH_CH3_V  0x00000007U
#define DMA2D_OUT_MEM_BURST_LENGTH_CH3_S  6
/** DMA2D_OUT_MACRO_BLOCK_SIZE_CH3 : R/W; bitpos: [10:9]; default: 0;
 *  Sel TX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
 *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
 *  descriptor
 */
#define DMA2D_OUT_MACRO_BLOCK_SIZE_CH3    0x00000003U
#define DMA2D_OUT_MACRO_BLOCK_SIZE_CH3_M  (DMA2D_OUT_MACRO_BLOCK_SIZE_CH3_V << DMA2D_OUT_MACRO_BLOCK_SIZE_CH3_S)
#define DMA2D_OUT_MACRO_BLOCK_SIZE_CH3_V  0x00000003U
#define DMA2D_OUT_MACRO_BLOCK_SIZE_CH3_S  9
/** DMA2D_OUT_DSCR_PORT_EN_CH3 : R/W; bitpos: [11]; default: 0;
 *  Set this bit to 1 to obtain descriptor from IP port
 */
#define DMA2D_OUT_DSCR_PORT_EN_CH3    (BIT(11))
#define DMA2D_OUT_DSCR_PORT_EN_CH3_M  (DMA2D_OUT_DSCR_PORT_EN_CH3_V << DMA2D_OUT_DSCR_PORT_EN_CH3_S)
#define DMA2D_OUT_DSCR_PORT_EN_CH3_V  0x00000001U
#define DMA2D_OUT_DSCR_PORT_EN_CH3_S  11
/** DMA2D_OUT_PAGE_BOUND_EN_CH3 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
 *  define by mem_burst_length
 */
#define DMA2D_OUT_PAGE_BOUND_EN_CH3    (BIT(12))
#define DMA2D_OUT_PAGE_BOUND_EN_CH3_M  (DMA2D_OUT_PAGE_BOUND_EN_CH3_V << DMA2D_OUT_PAGE_BOUND_EN_CH3_S)
#define DMA2D_OUT_PAGE_BOUND_EN_CH3_V  0x00000001U
#define DMA2D_OUT_PAGE_BOUND_EN_CH3_S  12
/** DMA2D_OUT_REORDER_EN_CH3 : R/W; bitpos: [16]; default: 0;
 *  Enable TX channel 0 macro block reorder when set to 1, only channel0 have this
 *  selection
 */
#define DMA2D_OUT_REORDER_EN_CH3    (BIT(16))
#define DMA2D_OUT_REORDER_EN_CH3_M  (DMA2D_OUT_REORDER_EN_CH3_V << DMA2D_OUT_REORDER_EN_CH3_S)
#define DMA2D_OUT_REORDER_EN_CH3_V  0x00000001U
#define DMA2D_OUT_REORDER_EN_CH3_S  16
/** DMA2D_OUT_RST_CH3 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset TX channel
 */
#define DMA2D_OUT_RST_CH3    (BIT(24))
#define DMA2D_OUT_RST_CH3_M  (DMA2D_OUT_RST_CH3_V << DMA2D_OUT_RST_CH3_S)
#define DMA2D_OUT_RST_CH3_V  0x00000001U
#define DMA2D_OUT_RST_CH3_S  24
/** DMA2D_OUT_CMD_DISABLE_CH3 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define DMA2D_OUT_CMD_DISABLE_CH3    (BIT(25))
#define DMA2D_OUT_CMD_DISABLE_CH3_M  (DMA2D_OUT_CMD_DISABLE_CH3_V << DMA2D_OUT_CMD_DISABLE_CH3_S)
#define DMA2D_OUT_CMD_DISABLE_CH3_V  0x00000001U
#define DMA2D_OUT_CMD_DISABLE_CH3_S  25
/** DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3    (BIT(26))
#define DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3_M  (DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3_V << DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3_S)
#define DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3_V  0x00000001U
#define DMA2D_OUT_ARB_WEIGHT_OPT_DIS_CH3_S  26

/** DMA2D_OUT_INT_RAW_CH3_REG register
 *  Raw interrupt status of TX channel 3
 */
#define DMA2D_OUT_INT_RAW_CH3_REG (DR_REG_DMA2D_BASE + 0x304)
/** DMA2D_OUT_DONE_CH3_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel 0.
 */
#define DMA2D_OUT_DONE_CH3_INT_RAW    (BIT(0))
#define DMA2D_OUT_DONE_CH3_INT_RAW_M  (DMA2D_OUT_DONE_CH3_INT_RAW_V << DMA2D_OUT_DONE_CH3_INT_RAW_S)
#define DMA2D_OUT_DONE_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DONE_CH3_INT_RAW_S  0
/** DMA2D_OUT_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel 0.
 */
#define DMA2D_OUT_EOF_CH3_INT_RAW    (BIT(1))
#define DMA2D_OUT_EOF_CH3_INT_RAW_M  (DMA2D_OUT_EOF_CH3_INT_RAW_V << DMA2D_OUT_EOF_CH3_INT_RAW_S)
#define DMA2D_OUT_EOF_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUT_EOF_CH3_INT_RAW_S  1
/** DMA2D_OUT_DSCR_ERR_CH3_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
 *  including owner error, the second and third word error of outlink descriptor for Tx
 *  channel 0.
 */
#define DMA2D_OUT_DSCR_ERR_CH3_INT_RAW    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH3_INT_RAW_M  (DMA2D_OUT_DSCR_ERR_CH3_INT_RAW_V << DMA2D_OUT_DSCR_ERR_CH3_INT_RAW_S)
#define DMA2D_OUT_DSCR_ERR_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH3_INT_RAW_S  2
/** DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel 0.
 */
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW_M  (DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW_V << DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW_S)
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_RAW_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW_V << DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_RAW_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW_V << DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_RAW_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW_V << DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_RAW_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW_V << DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_RAW_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW_V << DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_RAW_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW_V << DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_RAW_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is overflow.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW_M  (DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW_V << DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_RAW_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is underflow.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW_M  (DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW_V << DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW_S)
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_RAW_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW_M  (DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW_V << DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_RAW_S  12

/** DMA2D_OUT_INT_ENA_CH3_REG register
 *  Interrupt enable bits of TX channel 3
 */
#define DMA2D_OUT_INT_ENA_CH3_REG (DR_REG_DMA2D_BASE + 0x308)
/** DMA2D_OUT_DONE_CH3_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH3_INT_ENA    (BIT(0))
#define DMA2D_OUT_DONE_CH3_INT_ENA_M  (DMA2D_OUT_DONE_CH3_INT_ENA_V << DMA2D_OUT_DONE_CH3_INT_ENA_S)
#define DMA2D_OUT_DONE_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DONE_CH3_INT_ENA_S  0
/** DMA2D_OUT_EOF_CH3_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH3_INT_ENA    (BIT(1))
#define DMA2D_OUT_EOF_CH3_INT_ENA_M  (DMA2D_OUT_EOF_CH3_INT_ENA_V << DMA2D_OUT_EOF_CH3_INT_ENA_S)
#define DMA2D_OUT_EOF_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUT_EOF_CH3_INT_ENA_S  1
/** DMA2D_OUT_DSCR_ERR_CH3_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ENA    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ENA_M  (DMA2D_OUT_DSCR_ERR_CH3_INT_ENA_V << DMA2D_OUT_DSCR_ERR_CH3_INT_ENA_S)
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ENA_S  2
/** DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA_M  (DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA_V << DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA_S)
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ENA_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA_V << DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ENA_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA_V << DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ENA_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA_V << DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ENA_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA_V << DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ENA_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA_V << DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ENA_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA_V << DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ENA_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA_M  (DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA_V << DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ENA_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA_M  (DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA_V << DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA_S)
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ENA_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA_M  (DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA_V << DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ENA_S  12

