espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_OUT_INT_ST_CH3_REG register
 *  Masked interrupt status of TX channel 3
 */
#define DMA2D_OUT_INT_ST_CH3_REG (DR_REG_DMA2D_BASE + 0x30c)
/** DMA2D_OUT_DONE_CH3_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH3_INT_ST    (BIT(0))
#define DMA2D_OUT_DONE_CH3_INT_ST_M  (DMA2D_OUT_DONE_CH3_INT_ST_V << DMA2D_OUT_DONE_CH3_INT_ST_S)
#define DMA2D_OUT_DONE_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUT_DONE_CH3_INT_ST_S  0
/** DMA2D_OUT_EOF_CH3_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH3_INT_ST    (BIT(1))
#define DMA2D_OUT_EOF_CH3_INT_ST_M  (DMA2D_OUT_EOF_CH3_INT_ST_V << DMA2D_OUT_EOF_CH3_INT_ST_S)
#define DMA2D_OUT_EOF_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUT_EOF_CH3_INT_ST_S  1
/** DMA2D_OUT_DSCR_ERR_CH3_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ST    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ST_M  (DMA2D_OUT_DSCR_ERR_CH3_INT_ST_V << DMA2D_OUT_DSCR_ERR_CH3_INT_ST_S)
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH3_INT_ST_S  2
/** DMA2D_OUT_TOTAL_EOF_CH3_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ST    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ST_M  (DMA2D_OUT_TOTAL_EOF_CH3_INT_ST_V << DMA2D_OUT_TOTAL_EOF_CH3_INT_ST_S)
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_ST_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST_M  (DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST_V << DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_ST_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST_M  (DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST_V << DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_ST_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST_M  (DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST_V << DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_ST_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST_M  (DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST_V << DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_ST_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST_M  (DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST_V << DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_ST_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST_M  (DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST_V << DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_ST_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST_M  (DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST_V << DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_ST_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST : RO; bitpos: [11]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST_M  (DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST_V << DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST_S)
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_ST_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST : RO; bitpos: [12]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST_M  (DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST_V << DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_ST_S  12

/** DMA2D_OUT_INT_CLR_CH3_REG register
 *  Interrupt clear bits of TX channel 3
 */
#define DMA2D_OUT_INT_CLR_CH3_REG (DR_REG_DMA2D_BASE + 0x310)
/** DMA2D_OUT_DONE_CH3_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH3_INT_CLR    (BIT(0))
#define DMA2D_OUT_DONE_CH3_INT_CLR_M  (DMA2D_OUT_DONE_CH3_INT_CLR_V << DMA2D_OUT_DONE_CH3_INT_CLR_S)
#define DMA2D_OUT_DONE_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DONE_CH3_INT_CLR_S  0
/** DMA2D_OUT_EOF_CH3_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH3_INT_CLR    (BIT(1))
#define DMA2D_OUT_EOF_CH3_INT_CLR_M  (DMA2D_OUT_EOF_CH3_INT_CLR_V << DMA2D_OUT_EOF_CH3_INT_CLR_S)
#define DMA2D_OUT_EOF_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUT_EOF_CH3_INT_CLR_S  1
/** DMA2D_OUT_DSCR_ERR_CH3_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH3_INT_CLR    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH3_INT_CLR_M  (DMA2D_OUT_DSCR_ERR_CH3_INT_CLR_V << DMA2D_OUT_DSCR_ERR_CH3_INT_CLR_S)
#define DMA2D_OUT_DSCR_ERR_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH3_INT_CLR_S  2
/** DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR_M  (DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR_V << DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR_S)
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH3_INT_CLR_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR_V << DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH3_INT_CLR_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR_V << DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH3_INT_CLR_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR_V << DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH3_INT_CLR_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR_V << DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH3_INT_CLR_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR_V << DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH3_INT_CLR_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR_V << DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH3_INT_CLR_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR_M  (DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR_V << DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH3_INT_CLR_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR_M  (DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR_V << DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR_S)
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH3_INT_CLR_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR_M  (DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR_V << DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH3_INT_CLR_S  12

/** DMA2D_OUTFIFO_STATUS_CH3_REG register
 *  Represents the status of the tx fifo of channel 3
 */
#define DMA2D_OUTFIFO_STATUS_CH3_REG (DR_REG_DMA2D_BASE + 0x314)
/** DMA2D_OUTFIFO_FULL_L2_CH3 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L2_CH3    (BIT(0))
#define DMA2D_OUTFIFO_FULL_L2_CH3_M  (DMA2D_OUTFIFO_FULL_L2_CH3_V << DMA2D_OUTFIFO_FULL_L2_CH3_S)
#define DMA2D_OUTFIFO_FULL_L2_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L2_CH3_S  0
/** DMA2D_OUTFIFO_EMPTY_L2_CH3 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L2_CH3    (BIT(1))
#define DMA2D_OUTFIFO_EMPTY_L2_CH3_M  (DMA2D_OUTFIFO_EMPTY_L2_CH3_V << DMA2D_OUTFIFO_EMPTY_L2_CH3_S)
#define DMA2D_OUTFIFO_EMPTY_L2_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L2_CH3_S  1
/** DMA2D_OUTFIFO_CNT_L2_CH3 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L2_CH3    0x0000000FU
#define DMA2D_OUTFIFO_CNT_L2_CH3_M  (DMA2D_OUTFIFO_CNT_L2_CH3_V << DMA2D_OUTFIFO_CNT_L2_CH3_S)
#define DMA2D_OUTFIFO_CNT_L2_CH3_V  0x0000000FU
#define DMA2D_OUTFIFO_CNT_L2_CH3_S  2
/** DMA2D_OUT_REMAIN_UNDER_1B_CH3 : RO; bitpos: [7]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_1B_CH3    (BIT(7))
#define DMA2D_OUT_REMAIN_UNDER_1B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_1B_CH3_V << DMA2D_OUT_REMAIN_UNDER_1B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_1B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_1B_CH3_S  7
/** DMA2D_OUT_REMAIN_UNDER_2B_CH3 : RO; bitpos: [8]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_2B_CH3    (BIT(8))
#define DMA2D_OUT_REMAIN_UNDER_2B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_2B_CH3_V << DMA2D_OUT_REMAIN_UNDER_2B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_2B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_2B_CH3_S  8
/** DMA2D_OUT_REMAIN_UNDER_3B_CH3 : RO; bitpos: [9]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_3B_CH3    (BIT(9))
#define DMA2D_OUT_REMAIN_UNDER_3B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_3B_CH3_V << DMA2D_OUT_REMAIN_UNDER_3B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_3B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_3B_CH3_S  9
/** DMA2D_OUT_REMAIN_UNDER_4B_CH3 : RO; bitpos: [10]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_4B_CH3    (BIT(10))
#define DMA2D_OUT_REMAIN_UNDER_4B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_4B_CH3_V << DMA2D_OUT_REMAIN_UNDER_4B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_4B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_4B_CH3_S  10
/** DMA2D_OUT_REMAIN_UNDER_5B_CH3 : RO; bitpos: [11]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_5B_CH3    (BIT(11))
#define DMA2D_OUT_REMAIN_UNDER_5B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_5B_CH3_V << DMA2D_OUT_REMAIN_UNDER_5B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_5B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_5B_CH3_S  11
/** DMA2D_OUT_REMAIN_UNDER_6B_CH3 : RO; bitpos: [12]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_6B_CH3    (BIT(12))
#define DMA2D_OUT_REMAIN_UNDER_6B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_6B_CH3_V << DMA2D_OUT_REMAIN_UNDER_6B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_6B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_6B_CH3_S  12
/** DMA2D_OUT_REMAIN_UNDER_7B_CH3 : RO; bitpos: [13]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_7B_CH3    (BIT(13))
#define DMA2D_OUT_REMAIN_UNDER_7B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_7B_CH3_V << DMA2D_OUT_REMAIN_UNDER_7B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_7B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_7B_CH3_S  13
/** DMA2D_OUT_REMAIN_UNDER_8B_CH3 : RO; bitpos: [14]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_8B_CH3    (BIT(14))
#define DMA2D_OUT_REMAIN_UNDER_8B_CH3_M  (DMA2D_OUT_REMAIN_UNDER_8B_CH3_V << DMA2D_OUT_REMAIN_UNDER_8B_CH3_S)
#define DMA2D_OUT_REMAIN_UNDER_8B_CH3_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_8B_CH3_S  14
/** DMA2D_OUTFIFO_FULL_L1_CH3 : RO; bitpos: [15]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L1_CH3    (BIT(15))
#define DMA2D_OUTFIFO_FULL_L1_CH3_M  (DMA2D_OUTFIFO_FULL_L1_CH3_V << DMA2D_OUTFIFO_FULL_L1_CH3_S)
#define DMA2D_OUTFIFO_FULL_L1_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L1_CH3_S  15
/** DMA2D_OUTFIFO_EMPTY_L1_CH3 : RO; bitpos: [16]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L1_CH3    (BIT(16))
#define DMA2D_OUTFIFO_EMPTY_L1_CH3_M  (DMA2D_OUTFIFO_EMPTY_L1_CH3_V << DMA2D_OUTFIFO_EMPTY_L1_CH3_S)
#define DMA2D_OUTFIFO_EMPTY_L1_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L1_CH3_S  16
/** DMA2D_OUTFIFO_CNT_L1_CH3 : RO; bitpos: [21:17]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L1_CH3    0x0000001FU
#define DMA2D_OUTFIFO_CNT_L1_CH3_M  (DMA2D_OUTFIFO_CNT_L1_CH3_V << DMA2D_OUTFIFO_CNT_L1_CH3_S)
#define DMA2D_OUTFIFO_CNT_L1_CH3_V  0x0000001FU
#define DMA2D_OUTFIFO_CNT_L1_CH3_S  17
/** DMA2D_OUTFIFO_FULL_L3_CH3 : RO; bitpos: [22]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L3_CH3    (BIT(22))
#define DMA2D_OUTFIFO_FULL_L3_CH3_M  (DMA2D_OUTFIFO_FULL_L3_CH3_V << DMA2D_OUTFIFO_FULL_L3_CH3_S)
#define DMA2D_OUTFIFO_FULL_L3_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L3_CH3_S  22
/** DMA2D_OUTFIFO_EMPTY_L3_CH3 : RO; bitpos: [23]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L3_CH3    (BIT(23))
#define DMA2D_OUTFIFO_EMPTY_L3_CH3_M  (DMA2D_OUTFIFO_EMPTY_L3_CH3_V << DMA2D_OUTFIFO_EMPTY_L3_CH3_S)
#define DMA2D_OUTFIFO_EMPTY_L3_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L3_CH3_S  23
/** DMA2D_OUTFIFO_CNT_L3_CH3 : RO; bitpos: [28:24]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L3_CH3    0x0000001FU
#define DMA2D_OUTFIFO_CNT_L3_CH3_M  (DMA2D_OUTFIFO_CNT_L3_CH3_V << DMA2D_OUTFIFO_CNT_L3_CH3_S)
#define DMA2D_OUTFIFO_CNT_L3_CH3_V  0x0000001FU
#define DMA2D_OUTFIFO_CNT_L3_CH3_S  24

/** DMA2D_OUT_PUSH_CH3_REG register
 *  Configures the tx fifo of channel 3
 */
#define DMA2D_OUT_PUSH_CH3_REG (DR_REG_DMA2D_BASE + 0x318)
/** DMA2D_OUTFIFO_WDATA_CH3 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_WDATA_CH3    0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH3_M  (DMA2D_OUTFIFO_WDATA_CH3_V << DMA2D_OUTFIFO_WDATA_CH3_S)
#define DMA2D_OUTFIFO_WDATA_CH3_V  0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH3_S  0
/** DMA2D_OUTFIFO_PUSH_CH3 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_PUSH_CH3    (BIT(10))
#define DMA2D_OUTFIFO_PUSH_CH3_M  (DMA2D_OUTFIFO_PUSH_CH3_V << DMA2D_OUTFIFO_PUSH_CH3_S)
#define DMA2D_OUTFIFO_PUSH_CH3_V  0x00000001U
#define DMA2D_OUTFIFO_PUSH_CH3_S  10

/** DMA2D_OUT_LINK_CONF_CH3_REG register
 *  Configures the tx descriptor operations of channel 3
 */
#define DMA2D_OUT_LINK_CONF_CH3_REG (DR_REG_DMA2D_BASE + 0x31c)
/** DMA2D_OUTLINK_STOP_CH3 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_STOP_CH3    (BIT(20))
#define DMA2D_OUTLINK_STOP_CH3_M  (DMA2D_OUTLINK_STOP_CH3_V << DMA2D_OUTLINK_STOP_CH3_S)
#define DMA2D_OUTLINK_STOP_CH3_V  0x00000001U
#define DMA2D_OUTLINK_STOP_CH3_S  20
/** DMA2D_OUTLINK_START_CH3 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_START_CH3    (BIT(21))
#define DMA2D_OUTLINK_START_CH3_M  (DMA2D_OUTLINK_START_CH3_V << DMA2D_OUTLINK_START_CH3_S)
#define DMA2D_OUTLINK_START_CH3_V  0x00000001U
#define DMA2D_OUTLINK_START_CH3_S  21
/** DMA2D_OUTLINK_RESTART_CH3 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define DMA2D_OUTLINK_RESTART_CH3    (BIT(22))
#define DMA2D_OUTLINK_RESTART_CH3_M  (DMA2D_OUTLINK_RESTART_CH3_V << DMA2D_OUTLINK_RESTART_CH3_S)
#define DMA2D_OUTLINK_RESTART_CH3_V  0x00000001U
#define DMA2D_OUTLINK_RESTART_CH3_S  22
/** DMA2D_OUTLINK_PARK_CH3 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define DMA2D_OUTLINK_PARK_CH3    (BIT(23))
#define DMA2D_OUTLINK_PARK_CH3_M  (DMA2D_OUTLINK_PARK_CH3_V << DMA2D_OUTLINK_PARK_CH3_S)
#define DMA2D_OUTLINK_PARK_CH3_V  0x00000001U
#define DMA2D_OUTLINK_PARK_CH3_S  23

/** DMA2D_OUT_LINK_ADDR_CH3_REG register
 *  Configures the tx descriptor address of channel 3
 */
#define DMA2D_OUT_LINK_ADDR_CH3_REG (DR_REG_DMA2D_BASE + 0x320)
/** DMA2D_OUTLINK_ADDR_CH3 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define DMA2D_OUTLINK_ADDR_CH3    0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH3_M  (DMA2D_OUTLINK_ADDR_CH3_V << DMA2D_OUTLINK_ADDR_CH3_S)
#define DMA2D_OUTLINK_ADDR_CH3_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH3_S  0

/** DMA2D_OUT_STATE_CH3_REG register
 *  Represents the working status of the tx descriptor of channel 3
 */
#define DMA2D_OUT_STATE_CH3_REG (DR_REG_DMA2D_BASE + 0x324)
/** DMA2D_OUTLINK_DSCR_ADDR_CH3 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define DMA2D_OUTLINK_DSCR_ADDR_CH3    0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH3_M  (DMA2D_OUTLINK_DSCR_ADDR_CH3_V << DMA2D_OUTLINK_DSCR_ADDR_CH3_S)
#define DMA2D_OUTLINK_DSCR_ADDR_CH3_V  0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH3_S  0
/** DMA2D_OUT_DSCR_STATE_CH3 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define DMA2D_OUT_DSCR_STATE_CH3    0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH3_M  (DMA2D_OUT_DSCR_STATE_CH3_V << DMA2D_OUT_DSCR_STATE_CH3_S)
#define DMA2D_OUT_DSCR_STATE_CH3_V  0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH3_S  18
/** DMA2D_OUT_STATE_CH3 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define DMA2D_OUT_STATE_CH3    0x0000000FU
#define DMA2D_OUT_STATE_CH3_M  (DMA2D_OUT_STATE_CH3_V << DMA2D_OUT_STATE_CH3_S)
#define DMA2D_OUT_STATE_CH3_V  0x0000000FU
#define DMA2D_OUT_STATE_CH3_S  20
/** DMA2D_OUT_RESET_AVAIL_CH3 : RO; bitpos: [24]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_OUT_RESET_AVAIL_CH3    (BIT(24))
#define DMA2D_OUT_RESET_AVAIL_CH3_M  (DMA2D_OUT_RESET_AVAIL_CH3_V << DMA2D_OUT_RESET_AVAIL_CH3_S)
#define DMA2D_OUT_RESET_AVAIL_CH3_V  0x00000001U
#define DMA2D_OUT_RESET_AVAIL_CH3_S  24

/** DMA2D_OUT_EOF_DES_ADDR_CH3_REG register
 *  Represents the address associated with the outlink descriptor of channel 3
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH3_REG (DR_REG_DMA2D_BASE + 0x328)
/** DMA2D_OUT_EOF_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH3    0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH3_M  (DMA2D_OUT_EOF_DES_ADDR_CH3_V << DMA2D_OUT_EOF_DES_ADDR_CH3_S)
#define DMA2D_OUT_EOF_DES_ADDR_CH3_V  0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH3_S  0

