espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_OUT_DSCR_CH3_REG register
 *  Represents the address associated with the outlink descriptor of channel 3
 */
#define DMA2D_OUT_DSCR_CH3_REG (DR_REG_DMA2D_BASE + 0x32c)
/** DMA2D_OUTLINK_DSCR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define DMA2D_OUTLINK_DSCR_CH3    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH3_M  (DMA2D_OUTLINK_DSCR_CH3_V << DMA2D_OUTLINK_DSCR_CH3_S)
#define DMA2D_OUTLINK_DSCR_CH3_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH3_S  0

/** DMA2D_OUT_DSCR_BF0_CH3_REG register
 *  Represents the address associated with the outlink descriptor of channel 3
 */
#define DMA2D_OUT_DSCR_BF0_CH3_REG (DR_REG_DMA2D_BASE + 0x330)
/** DMA2D_OUTLINK_DSCR_BF0_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define DMA2D_OUTLINK_DSCR_BF0_CH3    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH3_M  (DMA2D_OUTLINK_DSCR_BF0_CH3_V << DMA2D_OUTLINK_DSCR_BF0_CH3_S)
#define DMA2D_OUTLINK_DSCR_BF0_CH3_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH3_S  0

/** DMA2D_OUT_DSCR_BF1_CH3_REG register
 *  Represents the address associated with the outlink descriptor of channel 3
 */
#define DMA2D_OUT_DSCR_BF1_CH3_REG (DR_REG_DMA2D_BASE + 0x334)
/** DMA2D_OUTLINK_DSCR_BF1_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define DMA2D_OUTLINK_DSCR_BF1_CH3    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH3_M  (DMA2D_OUTLINK_DSCR_BF1_CH3_V << DMA2D_OUTLINK_DSCR_BF1_CH3_S)
#define DMA2D_OUTLINK_DSCR_BF1_CH3_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF1_CH3_S  0

/** DMA2D_OUT_PERI_SEL_CH3_REG register
 *  Configures the tx peripheral of channel 3
 */
#define DMA2D_OUT_PERI_SEL_CH3_REG (DR_REG_DMA2D_BASE + 0x338)
/** DMA2D_OUT_PERI_SEL_CH3 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Tx channel   0:  jpeg     1:
 *  display-1     2: display-2     3: display-3      7: no choose
 */
#define DMA2D_OUT_PERI_SEL_CH3    0x00000007U
#define DMA2D_OUT_PERI_SEL_CH3_M  (DMA2D_OUT_PERI_SEL_CH3_V << DMA2D_OUT_PERI_SEL_CH3_S)
#define DMA2D_OUT_PERI_SEL_CH3_V  0x00000007U
#define DMA2D_OUT_PERI_SEL_CH3_S  0

/** DMA2D_OUT_ARB_CH3_REG register
 *  Configures the tx arbiter of channel 3
 */
#define DMA2D_OUT_ARB_CH3_REG (DR_REG_DMA2D_BASE + 0x33c)
/** DMA2D_OUT_ARB_TOKEN_NUM_CH3 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_OUT_ARB_TOKEN_NUM_CH3    0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH3_M  (DMA2D_OUT_ARB_TOKEN_NUM_CH3_V << DMA2D_OUT_ARB_TOKEN_NUM_CH3_S)
#define DMA2D_OUT_ARB_TOKEN_NUM_CH3_V  0x0000000FU
#define DMA2D_OUT_ARB_TOKEN_NUM_CH3_S  0
/** DMA2D_OUT_ARB_PRIORITY_CH3 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define DMA2D_OUT_ARB_PRIORITY_CH3    0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_CH3_M  (DMA2D_OUT_ARB_PRIORITY_CH3_V << DMA2D_OUT_ARB_PRIORITY_CH3_S)
#define DMA2D_OUT_ARB_PRIORITY_CH3_V  0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_CH3_S  4
/** DMA2D_OUT_ARB_PRIORITY_H_CH3 : R/W; bitpos: [7:6]; default: 0;
 *  Set the priority of channel
 */
#define DMA2D_OUT_ARB_PRIORITY_H_CH3    0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_H_CH3_M  (DMA2D_OUT_ARB_PRIORITY_H_CH3_V << DMA2D_OUT_ARB_PRIORITY_H_CH3_S)
#define DMA2D_OUT_ARB_PRIORITY_H_CH3_V  0x00000003U
#define DMA2D_OUT_ARB_PRIORITY_H_CH3_S  6

/** DMA2D_OUT_RO_STATUS_CH3_REG register
 *  Represents the status of the tx reorder module of channel 3
 */
#define DMA2D_OUT_RO_STATUS_CH3_REG (DR_REG_DMA2D_BASE + 0x340)
/** DMA2D_OUTFIFO_RO_CNT_CH3 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in color convert Tx FIFO for
 *  channel 0.
 */
#define DMA2D_OUTFIFO_RO_CNT_CH3    0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH3_M  (DMA2D_OUTFIFO_RO_CNT_CH3_V << DMA2D_OUTFIFO_RO_CNT_CH3_S)
#define DMA2D_OUTFIFO_RO_CNT_CH3_V  0x0000003FU
#define DMA2D_OUTFIFO_RO_CNT_CH3_S  0
/** DMA2D_OUT_RO_WR_STATE_CH3 : RO; bitpos: [7:6]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_OUT_RO_WR_STATE_CH3    0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH3_M  (DMA2D_OUT_RO_WR_STATE_CH3_V << DMA2D_OUT_RO_WR_STATE_CH3_S)
#define DMA2D_OUT_RO_WR_STATE_CH3_V  0x00000003U
#define DMA2D_OUT_RO_WR_STATE_CH3_S  6
/** DMA2D_OUT_RO_RD_STATE_CH3 : RO; bitpos: [9:8]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_OUT_RO_RD_STATE_CH3    0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH3_M  (DMA2D_OUT_RO_RD_STATE_CH3_V << DMA2D_OUT_RO_RD_STATE_CH3_S)
#define DMA2D_OUT_RO_RD_STATE_CH3_V  0x00000003U
#define DMA2D_OUT_RO_RD_STATE_CH3_S  8
/** DMA2D_OUT_PIXEL_BYTE_CH3 : RO; bitpos: [13:10]; default: 0;
 *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_OUT_PIXEL_BYTE_CH3    0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH3_M  (DMA2D_OUT_PIXEL_BYTE_CH3_V << DMA2D_OUT_PIXEL_BYTE_CH3_S)
#define DMA2D_OUT_PIXEL_BYTE_CH3_V  0x0000000FU
#define DMA2D_OUT_PIXEL_BYTE_CH3_S  10
/** DMA2D_OUT_BURST_BLOCK_NUM_CH3 : RO; bitpos: [17:14]; default: 0;
 *  the number of macro blocks contained in a burst of data at TX channel
 */
#define DMA2D_OUT_BURST_BLOCK_NUM_CH3    0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH3_M  (DMA2D_OUT_BURST_BLOCK_NUM_CH3_V << DMA2D_OUT_BURST_BLOCK_NUM_CH3_S)
#define DMA2D_OUT_BURST_BLOCK_NUM_CH3_V  0x0000000FU
#define DMA2D_OUT_BURST_BLOCK_NUM_CH3_S  14

/** DMA2D_OUT_COLOR_CONVERT_CH3_REG register
 *  Configures the tx color convert of channel 3
 */
#define DMA2D_OUT_COLOR_CONVERT_CH3_REG (DR_REG_DMA2D_BASE + 0x348)
/** DMA2D_OUT_COLOR_OUTPUT_SEL_CH3 : R/W; bitpos: [1:0]; default: 0;
 *  Set final color convert process and output type    0: RGB888 to RGB565     1:
 *  YUV444 to YUV422     2: output directly
 */
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH3    0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH3_M  (DMA2D_OUT_COLOR_OUTPUT_SEL_CH3_V << DMA2D_OUT_COLOR_OUTPUT_SEL_CH3_S)
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH3_V  0x00000003U
#define DMA2D_OUT_COLOR_OUTPUT_SEL_CH3_S  0
/** DMA2D_OUT_COLOR_3B_PROC_EN_CH3 : R/W; bitpos: [2]; default: 0;
 *  Enable generic color convert module between color input & color output, need to
 *  configure parameter.
 */
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH3    (BIT(2))
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH3_M  (DMA2D_OUT_COLOR_3B_PROC_EN_CH3_V << DMA2D_OUT_COLOR_3B_PROC_EN_CH3_S)
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH3_V  0x00000001U
#define DMA2D_OUT_COLOR_3B_PROC_EN_CH3_S  2
/** DMA2D_OUT_COLOR_INPUT_SEL_CH3 : R/W; bitpos: [5:3]; default: 7;
 *  Set first color convert process and input color type    0: RGB565 to RGB888     1:
 *  YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7:
 *  disable color space convert
 */
#define DMA2D_OUT_COLOR_INPUT_SEL_CH3    0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH3_M  (DMA2D_OUT_COLOR_INPUT_SEL_CH3_V << DMA2D_OUT_COLOR_INPUT_SEL_CH3_S)
#define DMA2D_OUT_COLOR_INPUT_SEL_CH3_V  0x00000007U
#define DMA2D_OUT_COLOR_INPUT_SEL_CH3_S  3

/** DMA2D_OUT_SCRAMBLE_CH3_REG register
 *  Configures the tx scramble of channel 3
 */
#define DMA2D_OUT_SCRAMBLE_CH3_REG (DR_REG_DMA2D_BASE + 0x34c)
/** DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3    0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3_M  (DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3_V << DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3_S)
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3_V  0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH3_S  0

/** DMA2D_OUT_COLOR_PARAM0_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM0_CH3_REG (DR_REG_DMA2D_BASE + 0x350)
/** DMA2D_OUT_COLOR_PARAM_H0_CH3 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H0_CH3    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH3_M  (DMA2D_OUT_COLOR_PARAM_H0_CH3_V << DMA2D_OUT_COLOR_PARAM_H0_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_H0_CH3_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH3_S  0

/** DMA2D_OUT_COLOR_PARAM1_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM1_CH3_REG (DR_REG_DMA2D_BASE + 0x354)
/** DMA2D_OUT_COLOR_PARAM_H1_CH3 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H1_CH3    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH3_M  (DMA2D_OUT_COLOR_PARAM_H1_CH3_V << DMA2D_OUT_COLOR_PARAM_H1_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_H1_CH3_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH3_S  0

/** DMA2D_OUT_COLOR_PARAM2_CH3_REG register
 *  Configures the tx color convert parameter of channel 3
 */
#define DMA2D_OUT_COLOR_PARAM2_CH3_REG (DR_REG_DMA2D_BASE + 0x358)
/** DMA2D_OUT_COLOR_PARAM_M0_CH3 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M0_CH3    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH3_M  (DMA2D_OUT_COLOR_PARAM_M0_CH3_V << DMA2D_OUT_COLOR_PARAM_M0_CH3_S)
#define DMA2D_OUT_COLOR_PARAM_M0_CH3_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH3_S  0

