espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_IN_INT_ENA_CH1_REG register
 *  Interrupt enable bits of RX channel 1
 */
#define DMA2D_IN_INT_ENA_CH1_REG (DR_REG_DMA2D_BASE + 0x608)
/** DMA2D_IN_DONE_CH1_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define DMA2D_IN_DONE_CH1_INT_ENA    (BIT(0))
#define DMA2D_IN_DONE_CH1_INT_ENA_M  (DMA2D_IN_DONE_CH1_INT_ENA_V << DMA2D_IN_DONE_CH1_INT_ENA_S)
#define DMA2D_IN_DONE_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_DONE_CH1_INT_ENA_S  0
/** DMA2D_IN_SUC_EOF_CH1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_SUC_EOF_CH1_INT_ENA    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH1_INT_ENA_M  (DMA2D_IN_SUC_EOF_CH1_INT_ENA_V << DMA2D_IN_SUC_EOF_CH1_INT_ENA_S)
#define DMA2D_IN_SUC_EOF_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH1_INT_ENA_S  1
/** DMA2D_IN_ERR_EOF_CH1_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_ERR_EOF_CH1_INT_ENA    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH1_INT_ENA_M  (DMA2D_IN_ERR_EOF_CH1_INT_ENA_V << DMA2D_IN_ERR_EOF_CH1_INT_ENA_S)
#define DMA2D_IN_ERR_EOF_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH1_INT_ENA_S  2
/** DMA2D_IN_DSCR_ERR_CH1_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_ERR_CH1_INT_ENA    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH1_INT_ENA_M  (DMA2D_IN_DSCR_ERR_CH1_INT_ENA_V << DMA2D_IN_DSCR_ERR_CH1_INT_ENA_S)
#define DMA2D_IN_DSCR_ERR_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH1_INT_ENA_S  3
/** DMA2D_INFIFO_OVF_L1_CH1_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ENA    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ENA_M  (DMA2D_INFIFO_OVF_L1_CH1_INT_ENA_V << DMA2D_INFIFO_OVF_L1_CH1_INT_ENA_S)
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ENA_S  4
/** DMA2D_INFIFO_UDF_L1_CH1_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ENA    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ENA_M  (DMA2D_INFIFO_UDF_L1_CH1_INT_ENA_V << DMA2D_INFIFO_UDF_L1_CH1_INT_ENA_S)
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ENA_S  5
/** DMA2D_INFIFO_OVF_L2_CH1_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ENA    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ENA_M  (DMA2D_INFIFO_OVF_L2_CH1_INT_ENA_V << DMA2D_INFIFO_OVF_L2_CH1_INT_ENA_S)
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ENA_S  6
/** DMA2D_INFIFO_UDF_L2_CH1_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ENA    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ENA_M  (DMA2D_INFIFO_UDF_L2_CH1_INT_ENA_V << DMA2D_INFIFO_UDF_L2_CH1_INT_ENA_S)
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ENA_S  7
/** DMA2D_INFIFO_OVF_L3_CH1_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ENA    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ENA_M  (DMA2D_INFIFO_OVF_L3_CH1_INT_ENA_V << DMA2D_INFIFO_OVF_L3_CH1_INT_ENA_S)
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ENA_S  8
/** DMA2D_INFIFO_UDF_L3_CH1_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ENA    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ENA_M  (DMA2D_INFIFO_UDF_L3_CH1_INT_ENA_V << DMA2D_INFIFO_UDF_L3_CH1_INT_ENA_S)
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ENA_S  9
/** DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA_M  (DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA_V << DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA_S)
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ENA_S  10
/** DMA2D_INFIFO_RO_OVF_CH1_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enable bit for the INFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ENA    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ENA_M  (DMA2D_INFIFO_RO_OVF_CH1_INT_ENA_V << DMA2D_INFIFO_RO_OVF_CH1_INT_ENA_S)
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ENA_S  11
/** DMA2D_INFIFO_RO_UDF_CH1_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enable bit for the INFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ENA    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ENA_M  (DMA2D_INFIFO_RO_UDF_CH1_INT_ENA_V << DMA2D_INFIFO_RO_UDF_CH1_INT_ENA_S)
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ENA_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ENA_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA_M  (DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA_V << DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ENA_S  13

/** DMA2D_IN_INT_ST_CH1_REG register
 *  Masked interrupt status of RX channel 1
 */
#define DMA2D_IN_INT_ST_CH1_REG (DR_REG_DMA2D_BASE + 0x60c)
/** DMA2D_IN_DONE_CH1_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define DMA2D_IN_DONE_CH1_INT_ST    (BIT(0))
#define DMA2D_IN_DONE_CH1_INT_ST_M  (DMA2D_IN_DONE_CH1_INT_ST_V << DMA2D_IN_DONE_CH1_INT_ST_S)
#define DMA2D_IN_DONE_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_DONE_CH1_INT_ST_S  0
/** DMA2D_IN_SUC_EOF_CH1_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_SUC_EOF_CH1_INT_ST    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH1_INT_ST_M  (DMA2D_IN_SUC_EOF_CH1_INT_ST_V << DMA2D_IN_SUC_EOF_CH1_INT_ST_S)
#define DMA2D_IN_SUC_EOF_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH1_INT_ST_S  1
/** DMA2D_IN_ERR_EOF_CH1_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_ERR_EOF_CH1_INT_ST    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH1_INT_ST_M  (DMA2D_IN_ERR_EOF_CH1_INT_ST_V << DMA2D_IN_ERR_EOF_CH1_INT_ST_S)
#define DMA2D_IN_ERR_EOF_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH1_INT_ST_S  2
/** DMA2D_IN_DSCR_ERR_CH1_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_ERR_CH1_INT_ST    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH1_INT_ST_M  (DMA2D_IN_DSCR_ERR_CH1_INT_ST_V << DMA2D_IN_DSCR_ERR_CH1_INT_ST_S)
#define DMA2D_IN_DSCR_ERR_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH1_INT_ST_S  3
/** DMA2D_INFIFO_OVF_L1_CH1_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ST    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ST_M  (DMA2D_INFIFO_OVF_L1_CH1_INT_ST_V << DMA2D_INFIFO_OVF_L1_CH1_INT_ST_S)
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH1_INT_ST_S  4
/** DMA2D_INFIFO_UDF_L1_CH1_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ST    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ST_M  (DMA2D_INFIFO_UDF_L1_CH1_INT_ST_V << DMA2D_INFIFO_UDF_L1_CH1_INT_ST_S)
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH1_INT_ST_S  5
/** DMA2D_INFIFO_OVF_L2_CH1_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ST    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ST_M  (DMA2D_INFIFO_OVF_L2_CH1_INT_ST_V << DMA2D_INFIFO_OVF_L2_CH1_INT_ST_S)
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH1_INT_ST_S  6
/** DMA2D_INFIFO_UDF_L2_CH1_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ST    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ST_M  (DMA2D_INFIFO_UDF_L2_CH1_INT_ST_V << DMA2D_INFIFO_UDF_L2_CH1_INT_ST_S)
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH1_INT_ST_S  7
/** DMA2D_INFIFO_OVF_L3_CH1_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ST    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ST_M  (DMA2D_INFIFO_OVF_L3_CH1_INT_ST_V << DMA2D_INFIFO_OVF_L3_CH1_INT_ST_S)
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH1_INT_ST_S  8
/** DMA2D_INFIFO_UDF_L3_CH1_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ST    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ST_M  (DMA2D_INFIFO_UDF_L3_CH1_INT_ST_V << DMA2D_INFIFO_UDF_L3_CH1_INT_ST_S)
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH1_INT_ST_S  9
/** DMA2D_IN_DSCR_EMPTY_CH1_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ST    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ST_M  (DMA2D_IN_DSCR_EMPTY_CH1_INT_ST_V << DMA2D_IN_DSCR_EMPTY_CH1_INT_ST_S)
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_ST_S  10
/** DMA2D_INFIFO_RO_OVF_CH1_INT_ST : RO; bitpos: [11]; default: 0;
 *  The raw interrupt status bit for the INFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ST    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ST_M  (DMA2D_INFIFO_RO_OVF_CH1_INT_ST_V << DMA2D_INFIFO_RO_OVF_CH1_INT_ST_S)
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH1_INT_ST_S  11
/** DMA2D_INFIFO_RO_UDF_CH1_INT_ST : RO; bitpos: [12]; default: 0;
 *  The raw interrupt status bit for the INFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ST    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ST_M  (DMA2D_INFIFO_RO_UDF_CH1_INT_ST_V << DMA2D_INFIFO_RO_UDF_CH1_INT_ST_S)
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ST_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH1_INT_ST_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST : RO; bitpos: [13]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST_M  (DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST_V << DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_ST_S  13

/** DMA2D_IN_INT_CLR_CH1_REG register
 *  Interrupt clear bits of RX channel 1
 */
#define DMA2D_IN_INT_CLR_CH1_REG (DR_REG_DMA2D_BASE + 0x610)
/** DMA2D_IN_DONE_CH1_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define DMA2D_IN_DONE_CH1_INT_CLR    (BIT(0))
#define DMA2D_IN_DONE_CH1_INT_CLR_M  (DMA2D_IN_DONE_CH1_INT_CLR_V << DMA2D_IN_DONE_CH1_INT_CLR_S)
#define DMA2D_IN_DONE_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_DONE_CH1_INT_CLR_S  0
/** DMA2D_IN_SUC_EOF_CH1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_SUC_EOF_CH1_INT_CLR    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH1_INT_CLR_M  (DMA2D_IN_SUC_EOF_CH1_INT_CLR_V << DMA2D_IN_SUC_EOF_CH1_INT_CLR_S)
#define DMA2D_IN_SUC_EOF_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH1_INT_CLR_S  1
/** DMA2D_IN_ERR_EOF_CH1_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_ERR_EOF_CH1_INT_CLR    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH1_INT_CLR_M  (DMA2D_IN_ERR_EOF_CH1_INT_CLR_V << DMA2D_IN_ERR_EOF_CH1_INT_CLR_S)
#define DMA2D_IN_ERR_EOF_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH1_INT_CLR_S  2
/** DMA2D_IN_DSCR_ERR_CH1_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_ERR_CH1_INT_CLR    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH1_INT_CLR_M  (DMA2D_IN_DSCR_ERR_CH1_INT_CLR_V << DMA2D_IN_DSCR_ERR_CH1_INT_CLR_S)
#define DMA2D_IN_DSCR_ERR_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH1_INT_CLR_S  3
/** DMA2D_INFIFO_OVF_L1_CH1_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L1_CH1_INT_CLR    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH1_INT_CLR_M  (DMA2D_INFIFO_OVF_L1_CH1_INT_CLR_V << DMA2D_INFIFO_OVF_L1_CH1_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L1_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH1_INT_CLR_S  4
/** DMA2D_INFIFO_UDF_L1_CH1_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L1_CH1_INT_CLR    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH1_INT_CLR_M  (DMA2D_INFIFO_UDF_L1_CH1_INT_CLR_V << DMA2D_INFIFO_UDF_L1_CH1_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L1_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH1_INT_CLR_S  5
/** DMA2D_INFIFO_OVF_L2_CH1_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L2_CH1_INT_CLR    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH1_INT_CLR_M  (DMA2D_INFIFO_OVF_L2_CH1_INT_CLR_V << DMA2D_INFIFO_OVF_L2_CH1_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L2_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH1_INT_CLR_S  6
/** DMA2D_INFIFO_UDF_L2_CH1_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L2_CH1_INT_CLR    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH1_INT_CLR_M  (DMA2D_INFIFO_UDF_L2_CH1_INT_CLR_V << DMA2D_INFIFO_UDF_L2_CH1_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L2_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH1_INT_CLR_S  7
/** DMA2D_INFIFO_OVF_L3_CH1_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L3_CH1_INT_CLR    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH1_INT_CLR_M  (DMA2D_INFIFO_OVF_L3_CH1_INT_CLR_V << DMA2D_INFIFO_OVF_L3_CH1_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L3_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH1_INT_CLR_S  8
/** DMA2D_INFIFO_UDF_L3_CH1_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L3_CH1_INT_CLR    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH1_INT_CLR_M  (DMA2D_INFIFO_UDF_L3_CH1_INT_CLR_V << DMA2D_INFIFO_UDF_L3_CH1_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L3_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH1_INT_CLR_S  9
/** DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR_M  (DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR_V << DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR_S)
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_CLR_S  10
/** DMA2D_INFIFO_RO_OVF_CH1_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_OVF_CH1_INT_CLR    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH1_INT_CLR_M  (DMA2D_INFIFO_RO_OVF_CH1_INT_CLR_V << DMA2D_INFIFO_RO_OVF_CH1_INT_CLR_S)
#define DMA2D_INFIFO_RO_OVF_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH1_INT_CLR_S  11
/** DMA2D_INFIFO_RO_UDF_CH1_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_UDF_CH1_INT_CLR    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH1_INT_CLR_M  (DMA2D_INFIFO_RO_UDF_CH1_INT_CLR_V << DMA2D_INFIFO_RO_UDF_CH1_INT_CLR_S)
#define DMA2D_INFIFO_RO_UDF_CH1_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH1_INT_CLR_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR_M  (DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR_V << DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_CLR_S  13

