espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_IN_SCRAMBLE_CH1_REG register
 *  Configures the rx scramble of channel 1
 */
#define DMA2D_IN_SCRAMBLE_CH1_REG (DR_REG_DMA2D_BASE + 0x650)
/** DMA2D_IN_SCRAMBLE_SEL_PRE_CH1 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH1    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH1_M  (DMA2D_IN_SCRAMBLE_SEL_PRE_CH1_V << DMA2D_IN_SCRAMBLE_SEL_PRE_CH1_S)
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH1_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH1_S  0
/** DMA2D_IN_SCRAMBLE_SEL_POST_CH1 : R/W; bitpos: [5:3]; default: 0;
 *  Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2
 *  3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH1    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH1_M  (DMA2D_IN_SCRAMBLE_SEL_POST_CH1_V << DMA2D_IN_SCRAMBLE_SEL_POST_CH1_S)
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH1_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH1_S  3

/** DMA2D_IN_COLOR_PARAM0_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM0_CH1_REG (DR_REG_DMA2D_BASE + 0x654)
/** DMA2D_IN_COLOR_PARAM_H0_CH1 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H0_CH1    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH1_M  (DMA2D_IN_COLOR_PARAM_H0_CH1_V << DMA2D_IN_COLOR_PARAM_H0_CH1_S)
#define DMA2D_IN_COLOR_PARAM_H0_CH1_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH1_S  0

/** DMA2D_IN_COLOR_PARAM1_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM1_CH1_REG (DR_REG_DMA2D_BASE + 0x658)
/** DMA2D_IN_COLOR_PARAM_H1_CH1 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H1_CH1    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH1_M  (DMA2D_IN_COLOR_PARAM_H1_CH1_V << DMA2D_IN_COLOR_PARAM_H1_CH1_S)
#define DMA2D_IN_COLOR_PARAM_H1_CH1_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH1_S  0

/** DMA2D_IN_COLOR_PARAM2_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM2_CH1_REG (DR_REG_DMA2D_BASE + 0x65c)
/** DMA2D_IN_COLOR_PARAM_M0_CH1 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M0_CH1    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH1_M  (DMA2D_IN_COLOR_PARAM_M0_CH1_V << DMA2D_IN_COLOR_PARAM_M0_CH1_S)
#define DMA2D_IN_COLOR_PARAM_M0_CH1_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH1_S  0

/** DMA2D_IN_COLOR_PARAM3_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM3_CH1_REG (DR_REG_DMA2D_BASE + 0x660)
/** DMA2D_IN_COLOR_PARAM_M1_CH1 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M1_CH1    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH1_M  (DMA2D_IN_COLOR_PARAM_M1_CH1_V << DMA2D_IN_COLOR_PARAM_M1_CH1_S)
#define DMA2D_IN_COLOR_PARAM_M1_CH1_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH1_S  0

/** DMA2D_IN_COLOR_PARAM4_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM4_CH1_REG (DR_REG_DMA2D_BASE + 0x664)
/** DMA2D_IN_COLOR_PARAM_L0_CH1 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L0_CH1    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH1_M  (DMA2D_IN_COLOR_PARAM_L0_CH1_V << DMA2D_IN_COLOR_PARAM_L0_CH1_S)
#define DMA2D_IN_COLOR_PARAM_L0_CH1_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH1_S  0

/** DMA2D_IN_COLOR_PARAM5_CH1_REG register
 *  Configures the rx color convert parameter of channel 1
 */
#define DMA2D_IN_COLOR_PARAM5_CH1_REG (DR_REG_DMA2D_BASE + 0x668)
/** DMA2D_IN_COLOR_PARAM_L1_CH1 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L1_CH1    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH1_M  (DMA2D_IN_COLOR_PARAM_L1_CH1_V << DMA2D_IN_COLOR_PARAM_L1_CH1_S)
#define DMA2D_IN_COLOR_PARAM_L1_CH1_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH1_S  0

/** DMA2D_IN_ETM_CONF_CH1_REG register
 *  Configures the rx etm of channel 1
 */
#define DMA2D_IN_ETM_CONF_CH1_REG (DR_REG_DMA2D_BASE + 0x66c)
/** DMA2D_IN_ETM_EN_CH1 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_EN_CH1    (BIT(0))
#define DMA2D_IN_ETM_EN_CH1_M  (DMA2D_IN_ETM_EN_CH1_V << DMA2D_IN_ETM_EN_CH1_S)
#define DMA2D_IN_ETM_EN_CH1_V  0x00000001U
#define DMA2D_IN_ETM_EN_CH1_S  0
/** DMA2D_IN_ETM_LOOP_EN_CH1 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_LOOP_EN_CH1    (BIT(1))
#define DMA2D_IN_ETM_LOOP_EN_CH1_M  (DMA2D_IN_ETM_LOOP_EN_CH1_V << DMA2D_IN_ETM_LOOP_EN_CH1_S)
#define DMA2D_IN_ETM_LOOP_EN_CH1_V  0x00000001U
#define DMA2D_IN_ETM_LOOP_EN_CH1_S  1
/** DMA2D_IN_DSCR_TASK_MAK_CH1 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_IN_DSCR_TASK_MAK_CH1    0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH1_M  (DMA2D_IN_DSCR_TASK_MAK_CH1_V << DMA2D_IN_DSCR_TASK_MAK_CH1_S)
#define DMA2D_IN_DSCR_TASK_MAK_CH1_V  0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH1_S  2

/** DMA2D_IN_CONF0_CH2_REG register
 *  Configures the rx direction of channel 2
 */
#define DMA2D_IN_CONF0_CH2_REG (DR_REG_DMA2D_BASE + 0x700)
/** DMA2D_IN_MEM_TRANS_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  enable memory trans of the same channel
 */
#define DMA2D_IN_MEM_TRANS_EN_CH2    (BIT(0))
#define DMA2D_IN_MEM_TRANS_EN_CH2_M  (DMA2D_IN_MEM_TRANS_EN_CH2_V << DMA2D_IN_MEM_TRANS_EN_CH2_S)
#define DMA2D_IN_MEM_TRANS_EN_CH2_V  0x00000001U
#define DMA2D_IN_MEM_TRANS_EN_CH2_S  0
/** DMA2D_INDSCR_BURST_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define DMA2D_INDSCR_BURST_EN_CH2    (BIT(2))
#define DMA2D_INDSCR_BURST_EN_CH2_M  (DMA2D_INDSCR_BURST_EN_CH2_V << DMA2D_INDSCR_BURST_EN_CH2_S)
#define DMA2D_INDSCR_BURST_EN_CH2_V  0x00000001U
#define DMA2D_INDSCR_BURST_EN_CH2_S  2
/** DMA2D_IN_ECC_AES_EN_CH2 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define DMA2D_IN_ECC_AES_EN_CH2    (BIT(3))
#define DMA2D_IN_ECC_AES_EN_CH2_M  (DMA2D_IN_ECC_AES_EN_CH2_V << DMA2D_IN_ECC_AES_EN_CH2_S)
#define DMA2D_IN_ECC_AES_EN_CH2_V  0x00000001U
#define DMA2D_IN_ECC_AES_EN_CH2_S  3
/** DMA2D_IN_CHECK_OWNER_CH2 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define DMA2D_IN_CHECK_OWNER_CH2    (BIT(4))
#define DMA2D_IN_CHECK_OWNER_CH2_M  (DMA2D_IN_CHECK_OWNER_CH2_V << DMA2D_IN_CHECK_OWNER_CH2_S)
#define DMA2D_IN_CHECK_OWNER_CH2_V  0x00000001U
#define DMA2D_IN_CHECK_OWNER_CH2_S  4
/** DMA2D_IN_LOOP_TEST_CH2 : R/W; bitpos: [5]; default: 0;
 *  reserved
 */
#define DMA2D_IN_LOOP_TEST_CH2    (BIT(5))
#define DMA2D_IN_LOOP_TEST_CH2_M  (DMA2D_IN_LOOP_TEST_CH2_V << DMA2D_IN_LOOP_TEST_CH2_S)
#define DMA2D_IN_LOOP_TEST_CH2_V  0x00000001U
#define DMA2D_IN_LOOP_TEST_CH2_S  5
/** DMA2D_IN_MEM_BURST_LENGTH_CH2 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define DMA2D_IN_MEM_BURST_LENGTH_CH2    0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH2_M  (DMA2D_IN_MEM_BURST_LENGTH_CH2_V << DMA2D_IN_MEM_BURST_LENGTH_CH2_S)
#define DMA2D_IN_MEM_BURST_LENGTH_CH2_V  0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH2_S  6
/** DMA2D_IN_MACRO_BLOCK_SIZE_CH2 : R/W; bitpos: [10:9]; default: 0;
 *  Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
 *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
 *  descriptor
 */
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH2    0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH2_M  (DMA2D_IN_MACRO_BLOCK_SIZE_CH2_V << DMA2D_IN_MACRO_BLOCK_SIZE_CH2_S)
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH2_V  0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH2_S  9
/** DMA2D_IN_DSCR_PORT_EN_CH2 : R/W; bitpos: [11]; default: 0;
 *  Set this bit to 1 to obtain descriptor from IP port
 */
#define DMA2D_IN_DSCR_PORT_EN_CH2    (BIT(11))
#define DMA2D_IN_DSCR_PORT_EN_CH2_M  (DMA2D_IN_DSCR_PORT_EN_CH2_V << DMA2D_IN_DSCR_PORT_EN_CH2_S)
#define DMA2D_IN_DSCR_PORT_EN_CH2_V  0x00000001U
#define DMA2D_IN_DSCR_PORT_EN_CH2_S  11
/** DMA2D_IN_PAGE_BOUND_EN_CH2 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define DMA2D_IN_PAGE_BOUND_EN_CH2    (BIT(12))
#define DMA2D_IN_PAGE_BOUND_EN_CH2_M  (DMA2D_IN_PAGE_BOUND_EN_CH2_V << DMA2D_IN_PAGE_BOUND_EN_CH2_S)
#define DMA2D_IN_PAGE_BOUND_EN_CH2_V  0x00000001U
#define DMA2D_IN_PAGE_BOUND_EN_CH2_S  12
/** DMA2D_IN_REORDER_EN_CH2 : R/W; bitpos: [16]; default: 0;
 *  Enable RX channel 0 macro block reorder when set to 1, only channel0 have this
 *  selection
 */
#define DMA2D_IN_REORDER_EN_CH2    (BIT(16))
#define DMA2D_IN_REORDER_EN_CH2_M  (DMA2D_IN_REORDER_EN_CH2_V << DMA2D_IN_REORDER_EN_CH2_S)
#define DMA2D_IN_REORDER_EN_CH2_V  0x00000001U
#define DMA2D_IN_REORDER_EN_CH2_S  16
/** DMA2D_IN_RST_CH2 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define DMA2D_IN_RST_CH2    (BIT(24))
#define DMA2D_IN_RST_CH2_M  (DMA2D_IN_RST_CH2_V << DMA2D_IN_RST_CH2_S)
#define DMA2D_IN_RST_CH2_V  0x00000001U
#define DMA2D_IN_RST_CH2_S  24
/** DMA2D_IN_CMD_DISABLE_CH2 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define DMA2D_IN_CMD_DISABLE_CH2    (BIT(25))
#define DMA2D_IN_CMD_DISABLE_CH2_M  (DMA2D_IN_CMD_DISABLE_CH2_V << DMA2D_IN_CMD_DISABLE_CH2_S)
#define DMA2D_IN_CMD_DISABLE_CH2_V  0x00000001U
#define DMA2D_IN_CMD_DISABLE_CH2_S  25
/** DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2    (BIT(26))
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2_M  (DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2_V << DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2_S)
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2_V  0x00000001U
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH2_S  26

/** DMA2D_IN_INT_RAW_CH2_REG register
 *  Raw interrupt status of RX channel 2
 */
#define DMA2D_IN_INT_RAW_CH2_REG (DR_REG_DMA2D_BASE + 0x704)
/** DMA2D_IN_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 0.
 */
#define DMA2D_IN_DONE_CH2_INT_RAW    (BIT(0))
#define DMA2D_IN_DONE_CH2_INT_RAW_M  (DMA2D_IN_DONE_CH2_INT_RAW_V << DMA2D_IN_DONE_CH2_INT_RAW_S)
#define DMA2D_IN_DONE_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_DONE_CH2_INT_RAW_S  0
/** DMA2D_IN_SUC_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 0.
 */
#define DMA2D_IN_SUC_EOF_CH2_INT_RAW    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH2_INT_RAW_M  (DMA2D_IN_SUC_EOF_CH2_INT_RAW_V << DMA2D_IN_SUC_EOF_CH2_INT_RAW_S)
#define DMA2D_IN_SUC_EOF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH2_INT_RAW_S  1
/** DMA2D_IN_ERR_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define DMA2D_IN_ERR_EOF_CH2_INT_RAW    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH2_INT_RAW_M  (DMA2D_IN_ERR_EOF_CH2_INT_RAW_V << DMA2D_IN_ERR_EOF_CH2_INT_RAW_S)
#define DMA2D_IN_ERR_EOF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH2_INT_RAW_S  2
/** DMA2D_IN_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 0.
 */
#define DMA2D_IN_DSCR_ERR_CH2_INT_RAW    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH2_INT_RAW_M  (DMA2D_IN_DSCR_ERR_CH2_INT_RAW_V << DMA2D_IN_DSCR_ERR_CH2_INT_RAW_S)
#define DMA2D_IN_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH2_INT_RAW_S  3
/** DMA2D_INFIFO_OVF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L1_CH2_INT_RAW    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH2_INT_RAW_M  (DMA2D_INFIFO_OVF_L1_CH2_INT_RAW_V << DMA2D_INFIFO_OVF_L1_CH2_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L1_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH2_INT_RAW_S  4
/** DMA2D_INFIFO_UDF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L1_CH2_INT_RAW    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH2_INT_RAW_M  (DMA2D_INFIFO_UDF_L1_CH2_INT_RAW_V << DMA2D_INFIFO_UDF_L1_CH2_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L1_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH2_INT_RAW_S  5
/** DMA2D_INFIFO_OVF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L2_CH2_INT_RAW    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH2_INT_RAW_M  (DMA2D_INFIFO_OVF_L2_CH2_INT_RAW_V << DMA2D_INFIFO_OVF_L2_CH2_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L2_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH2_INT_RAW_S  6
/** DMA2D_INFIFO_UDF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L2_CH2_INT_RAW    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH2_INT_RAW_M  (DMA2D_INFIFO_UDF_L2_CH2_INT_RAW_V << DMA2D_INFIFO_UDF_L2_CH2_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L2_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH2_INT_RAW_S  7
/** DMA2D_INFIFO_OVF_L3_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L3_CH2_INT_RAW    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH2_INT_RAW_M  (DMA2D_INFIFO_OVF_L3_CH2_INT_RAW_V << DMA2D_INFIFO_OVF_L3_CH2_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L3_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH2_INT_RAW_S  8
/** DMA2D_INFIFO_UDF_L3_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L3_CH2_INT_RAW    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH2_INT_RAW_M  (DMA2D_INFIFO_UDF_L3_CH2_INT_RAW_V << DMA2D_INFIFO_UDF_L3_CH2_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L3_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH2_INT_RAW_S  9
/** DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW_M  (DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW_V << DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW_S)
#define DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH2_INT_RAW_S  10
/** DMA2D_INFIFO_RO_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is overflow.
 */
#define DMA2D_INFIFO_RO_OVF_CH2_INT_RAW    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH2_INT_RAW_M  (DMA2D_INFIFO_RO_OVF_CH2_INT_RAW_V << DMA2D_INFIFO_RO_OVF_CH2_INT_RAW_S)
#define DMA2D_INFIFO_RO_OVF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH2_INT_RAW_S  11
/** DMA2D_INFIFO_RO_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is underflow.
 */
#define DMA2D_INFIFO_RO_UDF_CH2_INT_RAW    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH2_INT_RAW_M  (DMA2D_INFIFO_RO_UDF_CH2_INT_RAW_V << DMA2D_INFIFO_RO_UDF_CH2_INT_RAW_S)
#define DMA2D_INFIFO_RO_UDF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH2_INT_RAW_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW_M  (DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW_V << DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH2_INT_RAW_S  13

