espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_IN_LINK_CONF_CH2_REG register
 *  Configures the rx descriptor operations of channel 2
 */
#define DMA2D_IN_LINK_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x71c)
/** DMA2D_INLINK_AUTO_RET_CH2 : R/W; bitpos: [20]; default: 1;
 *  Set this bit to return to current inlink descriptor's address, when there are some
 *  errors in current receiving data.
 */
#define DMA2D_INLINK_AUTO_RET_CH2    (BIT(20))
#define DMA2D_INLINK_AUTO_RET_CH2_M  (DMA2D_INLINK_AUTO_RET_CH2_V << DMA2D_INLINK_AUTO_RET_CH2_S)
#define DMA2D_INLINK_AUTO_RET_CH2_V  0x00000001U
#define DMA2D_INLINK_AUTO_RET_CH2_S  20
/** DMA2D_INLINK_STOP_CH2 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_STOP_CH2    (BIT(21))
#define DMA2D_INLINK_STOP_CH2_M  (DMA2D_INLINK_STOP_CH2_V << DMA2D_INLINK_STOP_CH2_S)
#define DMA2D_INLINK_STOP_CH2_V  0x00000001U
#define DMA2D_INLINK_STOP_CH2_S  21
/** DMA2D_INLINK_START_CH2 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_START_CH2    (BIT(22))
#define DMA2D_INLINK_START_CH2_M  (DMA2D_INLINK_START_CH2_V << DMA2D_INLINK_START_CH2_S)
#define DMA2D_INLINK_START_CH2_V  0x00000001U
#define DMA2D_INLINK_START_CH2_S  22
/** DMA2D_INLINK_RESTART_CH2 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define DMA2D_INLINK_RESTART_CH2    (BIT(23))
#define DMA2D_INLINK_RESTART_CH2_M  (DMA2D_INLINK_RESTART_CH2_V << DMA2D_INLINK_RESTART_CH2_S)
#define DMA2D_INLINK_RESTART_CH2_V  0x00000001U
#define DMA2D_INLINK_RESTART_CH2_S  23
/** DMA2D_INLINK_PARK_CH2 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define DMA2D_INLINK_PARK_CH2    (BIT(24))
#define DMA2D_INLINK_PARK_CH2_M  (DMA2D_INLINK_PARK_CH2_V << DMA2D_INLINK_PARK_CH2_S)
#define DMA2D_INLINK_PARK_CH2_V  0x00000001U
#define DMA2D_INLINK_PARK_CH2_S  24

/** DMA2D_IN_LINK_ADDR_CH2_REG register
 *  Configures the rx descriptor address of channel 2
 */
#define DMA2D_IN_LINK_ADDR_CH2_REG (DR_REG_DMA2D_BASE + 0x720)
/** DMA2D_INLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define DMA2D_INLINK_ADDR_CH2    0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH2_M  (DMA2D_INLINK_ADDR_CH2_V << DMA2D_INLINK_ADDR_CH2_S)
#define DMA2D_INLINK_ADDR_CH2_V  0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH2_S  0

/** DMA2D_IN_STATE_CH2_REG register
 *  Represents the working status of the rx descriptor of channel 2
 */
#define DMA2D_IN_STATE_CH2_REG (DR_REG_DMA2D_BASE + 0x724)
/** DMA2D_INLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define DMA2D_INLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH2_M  (DMA2D_INLINK_DSCR_ADDR_CH2_V << DMA2D_INLINK_DSCR_ADDR_CH2_S)
#define DMA2D_INLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH2_S  0
/** DMA2D_IN_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define DMA2D_IN_DSCR_STATE_CH2    0x00000003U
#define DMA2D_IN_DSCR_STATE_CH2_M  (DMA2D_IN_DSCR_STATE_CH2_V << DMA2D_IN_DSCR_STATE_CH2_S)
#define DMA2D_IN_DSCR_STATE_CH2_V  0x00000003U
#define DMA2D_IN_DSCR_STATE_CH2_S  18
/** DMA2D_IN_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define DMA2D_IN_STATE_CH2    0x00000007U
#define DMA2D_IN_STATE_CH2_M  (DMA2D_IN_STATE_CH2_V << DMA2D_IN_STATE_CH2_S)
#define DMA2D_IN_STATE_CH2_V  0x00000007U
#define DMA2D_IN_STATE_CH2_S  20
/** DMA2D_IN_RESET_AVAIL_CH2 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_IN_RESET_AVAIL_CH2    (BIT(23))
#define DMA2D_IN_RESET_AVAIL_CH2_M  (DMA2D_IN_RESET_AVAIL_CH2_V << DMA2D_IN_RESET_AVAIL_CH2_S)
#define DMA2D_IN_RESET_AVAIL_CH2_V  0x00000001U
#define DMA2D_IN_RESET_AVAIL_CH2_S  23

/** DMA2D_IN_SUC_EOF_DES_ADDR_CH2_REG register
 *  Represents the address associated with the inlink descriptor of channel 2
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_DMA2D_BASE + 0x728)
/** DMA2D_IN_SUC_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH2_M  (DMA2D_IN_SUC_EOF_DES_ADDR_CH2_V << DMA2D_IN_SUC_EOF_DES_ADDR_CH2_S)
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH2_S  0

/** DMA2D_IN_ERR_EOF_DES_ADDR_CH2_REG register
 *  Represents the address associated with the inlink descriptor of channel 2
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_DMA2D_BASE + 0x72c)
/** DMA2D_IN_ERR_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH2_M  (DMA2D_IN_ERR_EOF_DES_ADDR_CH2_V << DMA2D_IN_ERR_EOF_DES_ADDR_CH2_S)
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH2_S  0

/** DMA2D_IN_DSCR_CH2_REG register
 *  Represents the address associated with the inlink descriptor of channel 2
 */
#define DMA2D_IN_DSCR_CH2_REG (DR_REG_DMA2D_BASE + 0x730)
/** DMA2D_INLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define DMA2D_INLINK_DSCR_CH2    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH2_M  (DMA2D_INLINK_DSCR_CH2_V << DMA2D_INLINK_DSCR_CH2_S)
#define DMA2D_INLINK_DSCR_CH2_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH2_S  0

/** DMA2D_IN_DSCR_BF0_CH2_REG register
 *  Represents the address associated with the inlink descriptor of channel 2
 */
#define DMA2D_IN_DSCR_BF0_CH2_REG (DR_REG_DMA2D_BASE + 0x734)
/** DMA2D_INLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define DMA2D_INLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH2_M  (DMA2D_INLINK_DSCR_BF0_CH2_V << DMA2D_INLINK_DSCR_BF0_CH2_S)
#define DMA2D_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH2_S  0

/** DMA2D_IN_DSCR_BF1_CH2_REG register
 *  Represents the address associated with the inlink descriptor of channel 2
 */
#define DMA2D_IN_DSCR_BF1_CH2_REG (DR_REG_DMA2D_BASE + 0x738)
/** DMA2D_INLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define DMA2D_INLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH2_M  (DMA2D_INLINK_DSCR_BF1_CH2_V << DMA2D_INLINK_DSCR_BF1_CH2_S)
#define DMA2D_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH2_S  0

/** DMA2D_IN_PERI_SEL_CH2_REG register
 *  Configures the rx peripheral of channel 2
 */
#define DMA2D_IN_PERI_SEL_CH2_REG (DR_REG_DMA2D_BASE + 0x73c)
/** DMA2D_IN_PERI_SEL_CH2 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Rx channel   0:  jpeg     1:
 *  display-1     2: display-2        7: no choose
 */
#define DMA2D_IN_PERI_SEL_CH2    0x00000007U
#define DMA2D_IN_PERI_SEL_CH2_M  (DMA2D_IN_PERI_SEL_CH2_V << DMA2D_IN_PERI_SEL_CH2_S)
#define DMA2D_IN_PERI_SEL_CH2_V  0x00000007U
#define DMA2D_IN_PERI_SEL_CH2_S  0

/** DMA2D_IN_ARB_CH2_REG register
 *  Configures the rx arbiter of channel 2
 */
#define DMA2D_IN_ARB_CH2_REG (DR_REG_DMA2D_BASE + 0x740)
/** DMA2D_IN_ARB_TOKEN_NUM_CH2 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_IN_ARB_TOKEN_NUM_CH2    0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH2_M  (DMA2D_IN_ARB_TOKEN_NUM_CH2_V << DMA2D_IN_ARB_TOKEN_NUM_CH2_S)
#define DMA2D_IN_ARB_TOKEN_NUM_CH2_V  0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH2_S  0
/** DMA2D_IN_ARB_PRIORITY_CH2 : R/W; bitpos: [4]; default: 1;
 *  Set the priority of channel
 */
#define DMA2D_IN_ARB_PRIORITY_CH2    (BIT(4))
#define DMA2D_IN_ARB_PRIORITY_CH2_M  (DMA2D_IN_ARB_PRIORITY_CH2_V << DMA2D_IN_ARB_PRIORITY_CH2_S)
#define DMA2D_IN_ARB_PRIORITY_CH2_V  0x00000001U
#define DMA2D_IN_ARB_PRIORITY_CH2_S  4
/** DMA2D_IN_ARB_PRIORITY_H_CH2 : R/W; bitpos: [7:5]; default: 0;
 *  Set the priority of channel
 */
#define DMA2D_IN_ARB_PRIORITY_H_CH2    0x00000007U
#define DMA2D_IN_ARB_PRIORITY_H_CH2_M  (DMA2D_IN_ARB_PRIORITY_H_CH2_V << DMA2D_IN_ARB_PRIORITY_H_CH2_S)
#define DMA2D_IN_ARB_PRIORITY_H_CH2_V  0x00000007U
#define DMA2D_IN_ARB_PRIORITY_H_CH2_S  5

/** DMA2D_IN_RO_STATUS_CH2_REG register
 *  Represents the status of the rx reorder module of channel 2
 */
#define DMA2D_IN_RO_STATUS_CH2_REG (DR_REG_DMA2D_BASE + 0x744)
/** DMA2D_INFIFO_RO_CNT_CH2 : RO; bitpos: [4:0]; default: 0;
 *  The register stores the byte number of the data in color convert Rx FIFO for
 *  channel 0.
 */
#define DMA2D_INFIFO_RO_CNT_CH2    0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH2_M  (DMA2D_INFIFO_RO_CNT_CH2_V << DMA2D_INFIFO_RO_CNT_CH2_S)
#define DMA2D_INFIFO_RO_CNT_CH2_V  0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH2_S  0
/** DMA2D_IN_RO_WR_STATE_CH2 : RO; bitpos: [6:5]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_IN_RO_WR_STATE_CH2    0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH2_M  (DMA2D_IN_RO_WR_STATE_CH2_V << DMA2D_IN_RO_WR_STATE_CH2_S)
#define DMA2D_IN_RO_WR_STATE_CH2_V  0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH2_S  5
/** DMA2D_IN_RO_RD_STATE_CH2 : RO; bitpos: [8:7]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_IN_RO_RD_STATE_CH2    0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH2_M  (DMA2D_IN_RO_RD_STATE_CH2_V << DMA2D_IN_RO_RD_STATE_CH2_S)
#define DMA2D_IN_RO_RD_STATE_CH2_V  0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH2_S  7
/** DMA2D_IN_PIXEL_BYTE_CH2 : RO; bitpos: [12:9]; default: 0;
 *  the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_IN_PIXEL_BYTE_CH2    0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH2_M  (DMA2D_IN_PIXEL_BYTE_CH2_V << DMA2D_IN_PIXEL_BYTE_CH2_S)
#define DMA2D_IN_PIXEL_BYTE_CH2_V  0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH2_S  9
/** DMA2D_IN_BURST_BLOCK_NUM_CH2 : RO; bitpos: [16:13]; default: 0;
 *  the number of macro blocks contained in a burst of data at RX channel
 */
#define DMA2D_IN_BURST_BLOCK_NUM_CH2    0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH2_M  (DMA2D_IN_BURST_BLOCK_NUM_CH2_V << DMA2D_IN_BURST_BLOCK_NUM_CH2_S)
#define DMA2D_IN_BURST_BLOCK_NUM_CH2_V  0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH2_S  13

/** DMA2D_IN_RO_PD_CONF_CH2_REG register
 *  Configures the rx reorder memory of channel 2
 */
#define DMA2D_IN_RO_PD_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x748)
/** DMA2D_IN_RO_RAM_FORCE_PD_CH2 : R/W; bitpos: [4]; default: 0;
 *  dma reorder ram power down
 */
#define DMA2D_IN_RO_RAM_FORCE_PD_CH2    (BIT(4))
#define DMA2D_IN_RO_RAM_FORCE_PD_CH2_M  (DMA2D_IN_RO_RAM_FORCE_PD_CH2_V << DMA2D_IN_RO_RAM_FORCE_PD_CH2_S)
#define DMA2D_IN_RO_RAM_FORCE_PD_CH2_V  0x00000001U
#define DMA2D_IN_RO_RAM_FORCE_PD_CH2_S  4
/** DMA2D_IN_RO_RAM_FORCE_PU_CH2 : R/W; bitpos: [5]; default: 1;
 *  dma reorder ram power up
 */
#define DMA2D_IN_RO_RAM_FORCE_PU_CH2    (BIT(5))
#define DMA2D_IN_RO_RAM_FORCE_PU_CH2_M  (DMA2D_IN_RO_RAM_FORCE_PU_CH2_V << DMA2D_IN_RO_RAM_FORCE_PU_CH2_S)
#define DMA2D_IN_RO_RAM_FORCE_PU_CH2_V  0x00000001U
#define DMA2D_IN_RO_RAM_FORCE_PU_CH2_S  5
/** DMA2D_IN_RO_RAM_CLK_FO_CH2 : R/W; bitpos: [6]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
 *  0: A gate-clock will be used when accessing the RAM in DMA.
 */
#define DMA2D_IN_RO_RAM_CLK_FO_CH2    (BIT(6))
#define DMA2D_IN_RO_RAM_CLK_FO_CH2_M  (DMA2D_IN_RO_RAM_CLK_FO_CH2_V << DMA2D_IN_RO_RAM_CLK_FO_CH2_S)
#define DMA2D_IN_RO_RAM_CLK_FO_CH2_V  0x00000001U
#define DMA2D_IN_RO_RAM_CLK_FO_CH2_S  6

