espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_IN_COLOR_CONVERT_CH2_REG register
 *  Configures the Rx color convert of channel 2
 */
#define DMA2D_IN_COLOR_CONVERT_CH2_REG (DR_REG_DMA2D_BASE + 0x74c)
/** DMA2D_IN_COLOR_OUTPUT_SEL_CH2 : R/W; bitpos: [1:0]; default: 0;
 *  Set final color convert process and output type    0: RGB888 to RGB565     1:
 *  output directly     2: YUV444 to YUV422    3: YUV444 to YUV420
 */
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH2    0x00000003U
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH2_M  (DMA2D_IN_COLOR_OUTPUT_SEL_CH2_V << DMA2D_IN_COLOR_OUTPUT_SEL_CH2_S)
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH2_V  0x00000003U
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH2_S  0
/** DMA2D_IN_COLOR_3B_PROC_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Enable generic color convert module between color input & color output, need to
 *  configure parameter.
 */
#define DMA2D_IN_COLOR_3B_PROC_EN_CH2    (BIT(2))
#define DMA2D_IN_COLOR_3B_PROC_EN_CH2_M  (DMA2D_IN_COLOR_3B_PROC_EN_CH2_V << DMA2D_IN_COLOR_3B_PROC_EN_CH2_S)
#define DMA2D_IN_COLOR_3B_PROC_EN_CH2_V  0x00000001U
#define DMA2D_IN_COLOR_3B_PROC_EN_CH2_S  2
/** DMA2D_IN_COLOR_INPUT_SEL_CH2 : R/W; bitpos: [5:3]; default: 7;
 *  Set first color convert process and input color type    0: YUV422/420 to YUV444
 *  1: YUV422      2: YUV444/420      7: disable color space convert
 */
#define DMA2D_IN_COLOR_INPUT_SEL_CH2    0x00000007U
#define DMA2D_IN_COLOR_INPUT_SEL_CH2_M  (DMA2D_IN_COLOR_INPUT_SEL_CH2_V << DMA2D_IN_COLOR_INPUT_SEL_CH2_S)
#define DMA2D_IN_COLOR_INPUT_SEL_CH2_V  0x00000007U
#define DMA2D_IN_COLOR_INPUT_SEL_CH2_S  3

/** DMA2D_IN_SCRAMBLE_CH2_REG register
 *  Configures the rx scramble of channel 2
 */
#define DMA2D_IN_SCRAMBLE_CH2_REG (DR_REG_DMA2D_BASE + 0x750)
/** DMA2D_IN_SCRAMBLE_SEL_PRE_CH2 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH2    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH2_M  (DMA2D_IN_SCRAMBLE_SEL_PRE_CH2_V << DMA2D_IN_SCRAMBLE_SEL_PRE_CH2_S)
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH2_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH2_S  0
/** DMA2D_IN_SCRAMBLE_SEL_POST_CH2 : R/W; bitpos: [5:3]; default: 0;
 *  Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2
 *  3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH2    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH2_M  (DMA2D_IN_SCRAMBLE_SEL_POST_CH2_V << DMA2D_IN_SCRAMBLE_SEL_POST_CH2_S)
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH2_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH2_S  3

/** DMA2D_IN_COLOR_PARAM0_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM0_CH2_REG (DR_REG_DMA2D_BASE + 0x754)
/** DMA2D_IN_COLOR_PARAM_H0_CH2 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H0_CH2    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH2_M  (DMA2D_IN_COLOR_PARAM_H0_CH2_V << DMA2D_IN_COLOR_PARAM_H0_CH2_S)
#define DMA2D_IN_COLOR_PARAM_H0_CH2_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH2_S  0

/** DMA2D_IN_COLOR_PARAM1_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM1_CH2_REG (DR_REG_DMA2D_BASE + 0x758)
/** DMA2D_IN_COLOR_PARAM_H1_CH2 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H1_CH2    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH2_M  (DMA2D_IN_COLOR_PARAM_H1_CH2_V << DMA2D_IN_COLOR_PARAM_H1_CH2_S)
#define DMA2D_IN_COLOR_PARAM_H1_CH2_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH2_S  0

/** DMA2D_IN_COLOR_PARAM2_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM2_CH2_REG (DR_REG_DMA2D_BASE + 0x75c)
/** DMA2D_IN_COLOR_PARAM_M0_CH2 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M0_CH2    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH2_M  (DMA2D_IN_COLOR_PARAM_M0_CH2_V << DMA2D_IN_COLOR_PARAM_M0_CH2_S)
#define DMA2D_IN_COLOR_PARAM_M0_CH2_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH2_S  0

/** DMA2D_IN_COLOR_PARAM3_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM3_CH2_REG (DR_REG_DMA2D_BASE + 0x760)
/** DMA2D_IN_COLOR_PARAM_M1_CH2 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M1_CH2    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH2_M  (DMA2D_IN_COLOR_PARAM_M1_CH2_V << DMA2D_IN_COLOR_PARAM_M1_CH2_S)
#define DMA2D_IN_COLOR_PARAM_M1_CH2_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH2_S  0

/** DMA2D_IN_COLOR_PARAM4_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM4_CH2_REG (DR_REG_DMA2D_BASE + 0x764)
/** DMA2D_IN_COLOR_PARAM_L0_CH2 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L0_CH2    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH2_M  (DMA2D_IN_COLOR_PARAM_L0_CH2_V << DMA2D_IN_COLOR_PARAM_L0_CH2_S)
#define DMA2D_IN_COLOR_PARAM_L0_CH2_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH2_S  0

/** DMA2D_IN_COLOR_PARAM5_CH2_REG register
 *  Configures the rx color convert parameter of channel 2
 */
#define DMA2D_IN_COLOR_PARAM5_CH2_REG (DR_REG_DMA2D_BASE + 0x768)
/** DMA2D_IN_COLOR_PARAM_L1_CH2 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L1_CH2    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH2_M  (DMA2D_IN_COLOR_PARAM_L1_CH2_V << DMA2D_IN_COLOR_PARAM_L1_CH2_S)
#define DMA2D_IN_COLOR_PARAM_L1_CH2_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH2_S  0

/** DMA2D_IN_ETM_CONF_CH2_REG register
 *  Configures the rx etm of channel 2
 */
#define DMA2D_IN_ETM_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x76c)
/** DMA2D_IN_ETM_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_EN_CH2    (BIT(0))
#define DMA2D_IN_ETM_EN_CH2_M  (DMA2D_IN_ETM_EN_CH2_V << DMA2D_IN_ETM_EN_CH2_S)
#define DMA2D_IN_ETM_EN_CH2_V  0x00000001U
#define DMA2D_IN_ETM_EN_CH2_S  0
/** DMA2D_IN_ETM_LOOP_EN_CH2 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_LOOP_EN_CH2    (BIT(1))
#define DMA2D_IN_ETM_LOOP_EN_CH2_M  (DMA2D_IN_ETM_LOOP_EN_CH2_V << DMA2D_IN_ETM_LOOP_EN_CH2_S)
#define DMA2D_IN_ETM_LOOP_EN_CH2_V  0x00000001U
#define DMA2D_IN_ETM_LOOP_EN_CH2_S  1
/** DMA2D_IN_DSCR_TASK_MAK_CH2 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_IN_DSCR_TASK_MAK_CH2    0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH2_M  (DMA2D_IN_DSCR_TASK_MAK_CH2_V << DMA2D_IN_DSCR_TASK_MAK_CH2_S)
#define DMA2D_IN_DSCR_TASK_MAK_CH2_V  0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH2_S  2

