espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dma2d_eco5_reg.h
/** DMA2D_AXI_ERR_REG register
 *  Represents the status of th axi bus
 */
#define DMA2D_AXI_ERR_REG (DR_REG_DMA2D_BASE + 0xa00)
/** DMA2D_RID_ERR_CNT : RO; bitpos: [3:0]; default: 0;
 *  AXI read id err cnt
 */
#define DMA2D_RID_ERR_CNT    0x0000000FU
#define DMA2D_RID_ERR_CNT_M  (DMA2D_RID_ERR_CNT_V << DMA2D_RID_ERR_CNT_S)
#define DMA2D_RID_ERR_CNT_V  0x0000000FU
#define DMA2D_RID_ERR_CNT_S  0
/** DMA2D_RRESP_ERR_CNT : RO; bitpos: [7:4]; default: 0;
 *  AXI read resp err cnt
 */
#define DMA2D_RRESP_ERR_CNT    0x0000000FU
#define DMA2D_RRESP_ERR_CNT_M  (DMA2D_RRESP_ERR_CNT_V << DMA2D_RRESP_ERR_CNT_S)
#define DMA2D_RRESP_ERR_CNT_V  0x0000000FU
#define DMA2D_RRESP_ERR_CNT_S  4
/** DMA2D_WRESP_ERR_CNT : RO; bitpos: [11:8]; default: 0;
 *  AXI write resp err cnt
 */
#define DMA2D_WRESP_ERR_CNT    0x0000000FU
#define DMA2D_WRESP_ERR_CNT_M  (DMA2D_WRESP_ERR_CNT_V << DMA2D_WRESP_ERR_CNT_S)
#define DMA2D_WRESP_ERR_CNT_V  0x0000000FU
#define DMA2D_WRESP_ERR_CNT_S  8
/** DMA2D_RD_FIFO_CNT : RO; bitpos: [14:12]; default: 0;
 *  AXI read cmd fifo remain cmd count
 */
#define DMA2D_RD_FIFO_CNT    0x00000007U
#define DMA2D_RD_FIFO_CNT_M  (DMA2D_RD_FIFO_CNT_V << DMA2D_RD_FIFO_CNT_S)
#define DMA2D_RD_FIFO_CNT_V  0x00000007U
#define DMA2D_RD_FIFO_CNT_S  12
/** DMA2D_RD_BAK_FIFO_CNT : RO; bitpos: [18:15]; default: 0;
 *  AXI read backup cmd fifo remain cmd count
 */
#define DMA2D_RD_BAK_FIFO_CNT    0x0000000FU
#define DMA2D_RD_BAK_FIFO_CNT_M  (DMA2D_RD_BAK_FIFO_CNT_V << DMA2D_RD_BAK_FIFO_CNT_S)
#define DMA2D_RD_BAK_FIFO_CNT_V  0x0000000FU
#define DMA2D_RD_BAK_FIFO_CNT_S  15
/** DMA2D_WR_FIFO_CNT : RO; bitpos: [21:19]; default: 0;
 *  AXI write cmd fifo remain cmd count
 */
#define DMA2D_WR_FIFO_CNT    0x00000007U
#define DMA2D_WR_FIFO_CNT_M  (DMA2D_WR_FIFO_CNT_V << DMA2D_WR_FIFO_CNT_S)
#define DMA2D_WR_FIFO_CNT_V  0x00000007U
#define DMA2D_WR_FIFO_CNT_S  19
/** DMA2D_WR_BAK_FIFO_CNT : RO; bitpos: [25:22]; default: 0;
 *  AXI write backup cmd fifo remain cmd count
 */
#define DMA2D_WR_BAK_FIFO_CNT    0x0000000FU
#define DMA2D_WR_BAK_FIFO_CNT_M  (DMA2D_WR_BAK_FIFO_CNT_V << DMA2D_WR_BAK_FIFO_CNT_S)
#define DMA2D_WR_BAK_FIFO_CNT_V  0x0000000FU
#define DMA2D_WR_BAK_FIFO_CNT_S  22

/** DMA2D_RST_CONF_REG register
 *  Configures the reset of axi
 */
#define DMA2D_RST_CONF_REG (DR_REG_DMA2D_BASE + 0xa04)
/** DMA2D_AXIM_RD_RST : R/W; bitpos: [0]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
 */
#define DMA2D_AXIM_RD_RST    (BIT(0))
#define DMA2D_AXIM_RD_RST_M  (DMA2D_AXIM_RD_RST_V << DMA2D_AXIM_RD_RST_S)
#define DMA2D_AXIM_RD_RST_V  0x00000001U
#define DMA2D_AXIM_RD_RST_S  0
/** DMA2D_AXIM_WR_RST : R/W; bitpos: [1]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
 */
#define DMA2D_AXIM_WR_RST    (BIT(1))
#define DMA2D_AXIM_WR_RST_M  (DMA2D_AXIM_WR_RST_V << DMA2D_AXIM_WR_RST_S)
#define DMA2D_AXIM_WR_RST_V  0x00000001U
#define DMA2D_AXIM_WR_RST_S  1
/** DMA2D_CLK_EN : R/W; bitpos: [2]; default: 0;
 *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
 *  registers.
 */
#define DMA2D_CLK_EN    (BIT(2))
#define DMA2D_CLK_EN_M  (DMA2D_CLK_EN_V << DMA2D_CLK_EN_S)
#define DMA2D_CLK_EN_V  0x00000001U
#define DMA2D_CLK_EN_S  2

/** DMA2D_INTR_MEM_START_ADDR_REG register
 *  The start address of accessible address space.
 */
#define DMA2D_INTR_MEM_START_ADDR_REG (DR_REG_DMA2D_BASE + 0xa08)
/** DMA2D_ACCESS_INTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define DMA2D_ACCESS_INTR_MEM_START_ADDR    0xFFFFFFFFU
#define DMA2D_ACCESS_INTR_MEM_START_ADDR_M  (DMA2D_ACCESS_INTR_MEM_START_ADDR_V << DMA2D_ACCESS_INTR_MEM_START_ADDR_S)
#define DMA2D_ACCESS_INTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define DMA2D_ACCESS_INTR_MEM_START_ADDR_S  0

/** DMA2D_INTR_MEM_END_ADDR_REG register
 *  The end address of accessible address space.
 */
#define DMA2D_INTR_MEM_END_ADDR_REG (DR_REG_DMA2D_BASE + 0xa0c)
/** DMA2D_ACCESS_INTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define DMA2D_ACCESS_INTR_MEM_END_ADDR    0xFFFFFFFFU
#define DMA2D_ACCESS_INTR_MEM_END_ADDR_M  (DMA2D_ACCESS_INTR_MEM_END_ADDR_V << DMA2D_ACCESS_INTR_MEM_END_ADDR_S)
#define DMA2D_ACCESS_INTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define DMA2D_ACCESS_INTR_MEM_END_ADDR_S  0

/** DMA2D_EXTR_MEM_START_ADDR_REG register
 *  The start address of accessible address space.
 */
#define DMA2D_EXTR_MEM_START_ADDR_REG (DR_REG_DMA2D_BASE + 0xa10)
/** DMA2D_ACCESS_EXTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define DMA2D_ACCESS_EXTR_MEM_START_ADDR    0xFFFFFFFFU
#define DMA2D_ACCESS_EXTR_MEM_START_ADDR_M  (DMA2D_ACCESS_EXTR_MEM_START_ADDR_V << DMA2D_ACCESS_EXTR_MEM_START_ADDR_S)
#define DMA2D_ACCESS_EXTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define DMA2D_ACCESS_EXTR_MEM_START_ADDR_S  0

/** DMA2D_EXTR_MEM_END_ADDR_REG register
 *  The end address of accessible address space.
 */
#define DMA2D_EXTR_MEM_END_ADDR_REG (DR_REG_DMA2D_BASE + 0xa14)
/** DMA2D_ACCESS_EXTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define DMA2D_ACCESS_EXTR_MEM_END_ADDR    0xFFFFFFFFU
#define DMA2D_ACCESS_EXTR_MEM_END_ADDR_M  (DMA2D_ACCESS_EXTR_MEM_END_ADDR_V << DMA2D_ACCESS_EXTR_MEM_END_ADDR_S)
#define DMA2D_ACCESS_EXTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define DMA2D_ACCESS_EXTR_MEM_END_ADDR_S  0

/** DMA2D_OUT_ARB_CONFIG_REG register
 *  Configures the tx arbiter
 */
#define DMA2D_OUT_ARB_CONFIG_REG (DR_REG_DMA2D_BASE + 0xa18)
/** DMA2D_OUT_ARB_TIMEOUT_NUM : R/W; bitpos: [15:0]; default: 0;
 *  Set the max number of timeout count of arbiter
 */
#define DMA2D_OUT_ARB_TIMEOUT_NUM    0x0000FFFFU
#define DMA2D_OUT_ARB_TIMEOUT_NUM_M  (DMA2D_OUT_ARB_TIMEOUT_NUM_V << DMA2D_OUT_ARB_TIMEOUT_NUM_S)
#define DMA2D_OUT_ARB_TIMEOUT_NUM_V  0x0000FFFFU
#define DMA2D_OUT_ARB_TIMEOUT_NUM_S  0
/** DMA2D_OUT_WEIGHT_EN : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define DMA2D_OUT_WEIGHT_EN    (BIT(16))
#define DMA2D_OUT_WEIGHT_EN_M  (DMA2D_OUT_WEIGHT_EN_V << DMA2D_OUT_WEIGHT_EN_S)
#define DMA2D_OUT_WEIGHT_EN_V  0x00000001U
#define DMA2D_OUT_WEIGHT_EN_S  16

/** DMA2D_IN_ARB_CONFIG_REG register
 *  Configures the rx arbiter
 */
#define DMA2D_IN_ARB_CONFIG_REG (DR_REG_DMA2D_BASE + 0xa1c)
/** DMA2D_IN_ARB_TIMEOUT_NUM : R/W; bitpos: [15:0]; default: 0;
 *  Set the max number of timeout count of arbiter
 */
#define DMA2D_IN_ARB_TIMEOUT_NUM    0x0000FFFFU
#define DMA2D_IN_ARB_TIMEOUT_NUM_M  (DMA2D_IN_ARB_TIMEOUT_NUM_V << DMA2D_IN_ARB_TIMEOUT_NUM_S)
#define DMA2D_IN_ARB_TIMEOUT_NUM_V  0x0000FFFFU
#define DMA2D_IN_ARB_TIMEOUT_NUM_S  0
/** DMA2D_IN_WEIGHT_EN : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define DMA2D_IN_WEIGHT_EN    (BIT(16))
#define DMA2D_IN_WEIGHT_EN_M  (DMA2D_IN_WEIGHT_EN_V << DMA2D_IN_WEIGHT_EN_S)
#define DMA2D_IN_WEIGHT_EN_V  0x00000001U
#define DMA2D_IN_WEIGHT_EN_S  16

/** DMA2D_RDN_RESULT_REG register
 *  reserved
 */
#define DMA2D_RDN_RESULT_REG (DR_REG_DMA2D_BASE + 0xa20)
/** DMA2D_RDN_ENA : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define DMA2D_RDN_ENA    (BIT(0))
#define DMA2D_RDN_ENA_M  (DMA2D_RDN_ENA_V << DMA2D_RDN_ENA_S)
#define DMA2D_RDN_ENA_V  0x00000001U
#define DMA2D_RDN_ENA_S  0
/** DMA2D_RDN_RESULT : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define DMA2D_RDN_RESULT    (BIT(1))
#define DMA2D_RDN_RESULT_M  (DMA2D_RDN_RESULT_V << DMA2D_RDN_RESULT_S)
#define DMA2D_RDN_RESULT_V  0x00000001U
#define DMA2D_RDN_RESULT_S  1

/** DMA2D_RDN_ECO_HIGH_REG register
 *  reserved
 */
#define DMA2D_RDN_ECO_HIGH_REG (DR_REG_DMA2D_BASE + 0xa24)
/** DMA2D_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  The start address of accessible address space.
 */
#define DMA2D_RDN_ECO_HIGH    0xFFFFFFFFU
#define DMA2D_RDN_ECO_HIGH_M  (DMA2D_RDN_ECO_HIGH_V << DMA2D_RDN_ECO_HIGH_S)
#define DMA2D_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define DMA2D_RDN_ECO_HIGH_S  0

/** DMA2D_RDN_ECO_LOW_REG register
 *  reserved
 */
#define DMA2D_RDN_ECO_LOW_REG (DR_REG_DMA2D_BASE + 0xa28)
/** DMA2D_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  The start address of accessible address space.
 */
#define DMA2D_RDN_ECO_LOW    0xFFFFFFFFU
#define DMA2D_RDN_ECO_LOW_M  (DMA2D_RDN_ECO_LOW_V << DMA2D_RDN_ECO_LOW_S)
#define DMA2D_RDN_ECO_LOW_V  0xFFFFFFFFU
#define DMA2D_RDN_ECO_LOW_S  0

/** DMA2D_DATE_REG register
 *  register version.
 */
#define DMA2D_DATE_REG (DR_REG_DMA2D_BASE + 0xa2c)
/** DMA2D_DATE : R/W; bitpos: [31:0]; default: 37822864;
 *  register version.
 */
#define DMA2D_DATE    0xFFFFFFFFU
#define DMA2D_DATE_M  (DMA2D_DATE_V << DMA2D_DATE_S)
#define DMA2D_DATE_V  0xFFFFFFFFU
#define DMA2D_DATE_S  0

#ifdef __cplusplus
}
#endif
